package mhw

import (
	"errors"
	"fmt"
	"strings"
)

func (dm *dataManager) loadArmors() {
	// https://www.mhchinese.wiki/equipments
	const rawDataStart = `
0 无 0 0 0
`

	const rawDataUpper = `
# 蛮颚
# 泥鱼

#----------------------------------------
@rare 5

@bonus 无
@resistences 0 -3 3 0 0
@set 飛雷龍α
1 飛雷龍頭盔α 				0 0 0 體術 +2
2 飛雷龍鎧甲α 				0 0 0 跳躍鐵人 +1 迴避距離UP +1
3 飛雷龍腕甲α 				0 0 0 迴避距離UP +2
4 飛雷龍腰甲α 				0 0 0 雷屬性攻擊強化 +2 雷耐性 +1
5 飛雷龍護腿α 				0 0 0 雷耐性 +1 體術 +1 
@set 飛雷龍β
1 飛雷龍頭盔β 				2 0 0 體術 +1
2 飛雷龍鎧甲β 				2 0 0 跳躍鐵人 +1
3 飛雷龍腕甲β 				2 0 0 迴避距離UP +1
4 飛雷龍腰甲β 				1 1 0 雷屬性攻擊強化 +1
5 飛雷龍護腿β 				1 1 0 雷耐性 +1
@bonus 无
@resistences -3 2 0 1 0
@set 浮空龍α
1 浮空龍頭盔α 				0 0 0 耐力急速回復 +2
2 浮空龍鎧甲α 				0 0 0 騎乘名人 +1 砲術 +1
3 浮空龍腕甲α 				0 0 0 砲術 +2
4 浮空龍腰甲α 				0 0 0 精靈加護 +2
5 浮空龍護腿α 				0 0 0 耐力急速回復 +1 風壓耐性 +1
@set 浮空龍β
1 浮空龍頭盔β 				2 0 0 耐力急速回復 +1
2 浮空龍鎧甲β 				1 0 0 騎乘名人 +1
3 浮空龍腕甲β 				1 0 0 砲術 +1
4 浮空龍腰甲β 				1 0 0 精靈加護 +1
5 浮空龍護腿β 				1 1 0 風壓耐性 +1
@bonus 无
@resistences 2 0 -2 0 -3
@set 雌火龍α
1 雌火龍頭盔α 				0 0 0 體力增強 +2 毒屬性強化 +1
2 雌火龍鎧甲α 				0 0 0 植生學 +2 體力回復量UP +1
3 雌火龍腕甲α 				0 0 0 毒屬性強化 +2
4 雌火龍腰甲α 				0 0 0 毒耐性 +2 體力增強 +1
5 雌火龍護腿α 				0 0 0 體力回復量UP +2 
@set 雌火龍β
1 雌火龍頭盔β 				1 0 0 體力增強 +1 毒屬性強化 +1
2 雌火龍鎧甲β 				1 0 0 植生學 +1 體力回復量UP +1
3 雌火龍腕甲β 				1 0 0 毒屬性強化 +1
4 雌火龍腰甲β 				1 0 0 毒耐性 +1 體力增強 +1
5 雌火龍護腿β 				1 0 0 體力回復量UP +1

#----------------------------------------
@rare 6
@bonus 櫻火龍之奧秘
@resistences 3 0 0 -3 -4
@set 火龍心α
1 火龍心頭盔α 				0 0 0 迴避距離UP +1 毒屬性強化 +1
2 火龍心鎧甲α 				0 0 0 整備 +2
3 火龍心腕甲α 				0 0 0 風壓耐性 +2
4 火龍心腰甲α 				0 0 0 匠 +1 毒耐性 +1
5 火龍心護腿α 				0 0 0 整備 +1 風壓耐性 +1
@set 火龍心β
1 火龍心頭盔β 				2 0 0 迴避距離UP +1
2 火龍心鎧甲β 				1 1 0 整備 +1
3 火龍心腕甲β 				2 0 0 風壓耐性 +1
4 火龍心腰甲β 				1 0 0 匠 +1
5 火龍心護腿β 				2 0 0 整備 +1
@bonus 无
@resistences 0 2 0 -1 -2
@set 骨鎚龍α
1 骨鎚龍頭盔α 				0 0 0 耐震 +2
2 骨鎚龍鎧甲α 				0 0 0 睡眠屬性強化 +1 裂傷耐性 +1
3 骨鎚龍腕甲α 				0 0 0 睡眠屬性強化 +2 防禦性能 +1
4 骨鎚龍腰甲α 				0 0 0 防禦性能 +2
5 骨鎚龍護腿α 				0 0 0 裂傷耐性 +2
@set 骨鎚龍β
1 骨鎚龍頭盔β 				2 0 0 耐震 +1
2 骨鎚龍鎧甲β 				1 0 0 睡眠屬性強化 +1
3 骨鎚龍腕甲β 				1 0 0 睡眠屬性強化 +1 防禦性能 +1
4 骨鎚龍腰甲β 				2 0 0 防禦性能 +1
5 骨鎚龍護腿β 				1 0 0 裂傷耐性 +1

#----------------------------------------
@rare 5
@bonus 无
@set 无
@resistences 3 0 0 0 0
1 突擊龍角α					0 0 0 減輕膽怯 +1 爆破異常狀態的耐性 +1
1 突擊龍角β					1 0 0 減輕膽怯 +1
@resistences 2 0 -3 0 2
2 酸翼龍斗篷α					0 0 0 熱傷害無效 +1 防御力DOWN耐性 +1
2 酸翼龍斗篷β					1 0 0 熱傷害無效 +1
@bonus 无
@resistences 2 0 -3 0 2
@set 岩賊龍α
1 岩賊龍頭盔α 				0 0 0 爆破異常狀態的耐性 +2
2 岩賊龍鎧甲α 				0 0 0 爆破屬性強化 +2
3 岩賊龍腕甲α 				0 0 0 炸彈客 +2
4 岩賊龍腰甲α 				0 0 0 砲術 +2 爆破異常狀態的耐性 +1
5 岩賊龍護腿α 				0 0 0 砲彈裝填數UP +1 爆破屬性強化 +1
@set 岩賊龍β
1 岩賊龍頭盔β 				1 0 0 爆破異常狀態的耐性 +1
2 岩賊龍鎧甲β 				1 0 0 爆破屬性強化 +1
3 岩賊龍腕甲β 				1 0 0 炸彈客 +1
4 岩賊龍腰甲β 				1 0 0 砲術 +2
5 岩賊龍護腿β 				1 0 0 砲彈裝填數UP +1

#----------------------------------------
@rare 6
@bonus 熔山龍的奧秘
@resistences 4 -3 -1 -2 -3
@set 鑄島熔岩α
1 鑄島熔岩頭飾α 				0 0 0 匠 +1 爆破屬性強化 +1
2 鑄島熔岩皮α 				0 0 0 爆破屬性強化 +2 風壓耐性 +1
3 鑄島熔岩鋼爪α 				0 0 0 屬性解放／裝填擴充 +1 炸彈客 +1
4 鑄島熔岩脊椎α 				0 0 0 不屈 +1 耐震 +1
5 鑄島熔岩靴α 				0 0 0 炸彈客 +1 耳塞 +1
@set 鑄島熔岩β
1 鑄島熔岩頭飾β 				1 0 0 匠 +1
2 鑄島熔岩皮β 				2 0 0 爆破屬性強化 +2
3 鑄島熔岩鋼爪β 				1 0 0 屬性解放／裝填擴充 +1
4 鑄島熔岩脊椎β 				2 0 0 不屈 +1
5 鑄島熔岩靴β 				2 0 0 炸彈客 +2
@bonus 无
@resistences 0 -1 -2 3 0
@set 礦石α
1 礦石頭盔α 					0 0 0 冰耐性 +2 耳塞 +1
2 礦石鎧甲α 					0 0 0 耳塞 +2 冰屬性攻擊強化 +1
3 礦石腕甲α 					0 0 0 防禦 +2 冰屬性攻擊強化 +1
4 礦石腰甲α 					0 0 0 砲彈裝填數UP +1 防禦 +1
5 礦石護腿α 					0 0 0 砲擊手 +1 冰耐性 +1
@set 礦石β
1 礦石頭盔β 					2 0 0 冰耐性 +2
2 礦石鎧甲β 					2 0 0 耳塞 +1 冰屬性攻擊強化 +1
3 礦石腕甲β 					1 0 0 防禦 +2
4 礦石腰甲β 					1 0 0 砲彈裝填數UP +1
5 礦石護腿β 					1 0 0 砲擊手 +1
@bonus 无
@resistences -2 0 3 -1 0
@set 鑄鐵α
1 鑄鐵頭盔α 					0 0 0 雷屬性攻擊強化 +2
2 鑄鐵鎧甲α 					0 0 0 雷耐性 +2
3 鑄鐵腕甲α 					0 0 0 體力增強 +2 雷屬性攻擊強化 +1
4 鑄鐵腰甲α 					0 0 0 風壓耐性 +2
5 鑄鐵護腿α 					0 0 0 防禦 +2 風壓耐性 +1
@set 鑄鐵β
1 鑄鐵頭盔β 					1 0 0 雷屬性攻擊強化 +1
2 鑄鐵鎧甲β 					1 0 0 雷耐性 +1
3 鑄鐵腕甲β 					1 0 0 體力增強 +2
4 鑄鐵腰甲β 					3 0 0 風壓耐性 +1
5 鑄鐵護腿β 					2 0 0 防禦 +2
@bonus 无
@resistences 1 0 2 0 2
@set 旅團α
1 旅團頭盔α 					0 0 0 回復速度 +2 吹笛名人 +1
2 旅團鎧甲α 					2 0 0 精靈加護 +2
3 旅團腕甲α 					0 0 0 砲擊手 +2 精靈加護 +1
4 旅團腰甲α 					0 0 0 地質學 +2 回復速度 +1
5 旅團護腿α 					1 0 0 研究者 +1 地質學 +1
@set 旅團β
1 旅團頭盔β 					1 0 0 回復速度 +2
2 旅團鎧甲β 					2 2 0 精靈加護 +1
3 旅團腕甲β 					1 0 0 砲擊手 +2
4 旅團腰甲β 					1 0 0 地質學 +2
5 旅團護腿β 					3 0 0 研究者 +1
@bonus 无
@set 无
@resistences 2 2 2 2 2
1 艾路頭套α 					0 0 0 指示隨從 +3
@resistences 2 2 2 2 2
1 知性眼鏡α					1 0 0 看破 +2
@bonus 无
@resistences 3 -3 1 -2 2
@set 熔岩龍α
1 熔岩龍頭盔α 				0 0 0 火屬性攻擊強化 +2 收刀術 +1
2 熔岩龍鎧甲α 				0 0 0 火屬性攻擊強化 +2 熱傷害無效 +1
3 熔岩龍腕甲α 				2 0 0 滑走強化 +1 廣域化 +1
4 熔岩龍腰甲α 				0 0 0 收刀術 +2 體力回復量UP +1
5 熔岩龍護腿α 				1 0 0 散彈・剛射強化 +1 火屬性攻擊強化 +1
@set 熔岩龍β
1 熔岩龍頭盔β 				1 1 0 火屬性攻擊強化 +1 收刀術 +1
2 熔岩龍鎧甲β 				1 1 0 火屬性攻擊強化 +2
3 熔岩龍腕甲β 				3 0 0 滑走強化 +1
4 熔岩龍腰甲β 				1 0 0 收刀術 +2
5 熔岩龍護腿β 				2 0 0 散彈・剛射強化 +1
@bonus 風漂龍的恩竉
@resistences -1 2 -3 3 0
@set 風漂龍α
1 風漂龍頭盔α 				0 0 0 精靈加護 +2 冰屬性攻擊強化 +1
2 風漂龍鎧甲α 				0 0 0 迴避性能 +2 精靈加護 +1
3 風漂龍腕甲α 				0 0 0 飛燕 +1 迴避性能 +1
4 風漂龍腰甲α 				0 0 0 冰屬性攻擊強化 +2 風壓耐性 +1
5 風漂龍護腿α 				0 0 0 冰耐性 +2 拔刀術【技】 +1
@set 風漂龍β
1 風漂龍頭盔β 				1 0 0 精靈加護 +2
2 風漂龍鎧甲β 				1 0 0 迴避性能 +2
3 風漂龍腕甲β 				3 0 0 飛燕 +1
4 風漂龍腰甲β 				2 0 0 冰屬性攻擊強化 +2
5 風漂龍護腿β 				3 0 0 冰耐性 +2
@bonus 慘爪龍的奧祕
@resistences 2 2 -2 -3 0
@set 慘爪龍α
1 慘爪龍頭盔α 				0 0 0 裂傷耐性 +2 看破 +1
2 慘爪龍鎧甲α 				0 0 0 砥石使用高速化 +2 裂傷耐性 +1
3 慘爪龍腕甲α 				0 0 0 體術 +1 看破 +1
4 慘爪龍腰甲α 				0 0 0 看破 +2 砥石使用高速化 +1
5 慘爪龍護腿α 				0 0 0 收刀術 +1 看破 +1
@set 慘爪龍β
1 慘爪龍頭盔β 				2 0 0 裂傷耐性 +2
2 慘爪龍鎧甲β 				1 0 0 砥石使用高速化 +2
3 慘爪龍腕甲β 				1 0 0 體術 +1
4 慘爪龍腰甲β 				2 0 0 看破 +2
5 慘爪龍護腿β 				1 0 0 收刀術 +1
@bonus 火龍奧祕
@resistences 3 1 -2 1 -3
@set 火龍α
1 火龍頭盔α 					0 0 0 攻擊 +2 火屬性攻擊強化 +1
2 火龍鎧甲α 					0 0 0 弱點特效 +2 火屬性攻擊強化 +1
3 火龍腕甲α 					0 0 0 火耐性 +2 攻擊 +1
4 火龍腰甲α 					0 0 0 火屬性攻擊強化 +2 集中 +1
5 火龍護腿α 					0 0 0 跳躍鐵人 +1 弱點特效 +1
@set 火龍β
1 火龍頭盔β 					1 0 0 攻擊 +2
2 火龍鎧甲β 					1 0 0 弱點特效 +2
3 火龍腕甲β 					1 0 0 火耐性 +2
4 火龍腰甲β 					2 0 0 火屬性攻擊強化 +2
5 火龍護腿β 					3 0 0 跳躍鐵人 +1

#----------------------------------------
@rare 7
@bonus 火龍奧祕
@resistences 3 2 3 -3 -4
@set 火龍魂α
1 火龍魂頭盔α 				0 0 0 超會心 +1 威嚇 +2
2 火龍魂鎧甲α 				1 0 0 屬性解放／裝填擴充 +1 威嚇 +1
3 火龍魂腕甲α 				1 0 0 集中 +1 風壓耐性 +1
4 火龍魂腰甲α 				0 0 0 風壓耐性 +2 貫通彈・龍之箭強化 +1
5 火龍魂護腿α 				0 0 0 集中 +1 攀岩者 +1 
@set 火龍魂β
1 火龍魂頭盔β 				1 1 0 超會心 +1
2 火龍魂鎧甲β 				2 0 0 屬性解放／裝填擴充 +1
3 火龍魂腕甲β 				2 0 0 集中 +1
4 火龍魂腰甲β 				3 0 0 風壓耐性 +2
5 火龍魂護腿β 				1 0 0 集中 +1

#----------------------------------------
@rare 6
@bonus 角龍之奧祕
@resistences 3 -2 0 -3 2
@set 角龍α
1 角龍頭盔α 					0 0 0 拔刀術【技】 +2 火場怪力 +1
2 角龍鎧甲α 					0 0 0 KO術 +2 火場怪力 +1
3 角龍腕甲α 					0 0 0 火場怪力 +2 耐震 +1
4 角龍腰甲α 					0 0 0 跑者 +2 拔刀術【技】 +1
5 角龍護腿α 					0 0 0 耐震 +2 KO術 +1
@set 角龍β
1 角龍頭盔β 					2 0 0 拔刀術【技】 +2
2 角龍鎧甲β 					2 0 0 KO術 +2
3 角龍腕甲β 					2 0 0 火場怪力 +2
4 角龍腰甲β 					2 0 0 跑者 +2
5 角龍護腿β 					1 1 0 耐震 +2

#----------------------------------------
@rare 7
@bonus 角龍之奧祕
@resistences 2 -3 0 -4 2
@set 暴君角龍α
1 暴君角龍頭盔α				1 0 0 集中 +2
2 暴君角龍鎧甲α				1 0 0 怨恨 +2
3 暴君角龍腕甲α				0 0 0 集中 +1 跑者 +1
4 暴君角龍腰甲α				0 0 0 怨恨 +1 破壞王 +1
5 暴君角龍護腿α				1 0 0 通常彈・通常箭強化 +1 火場怪力 +1 
@set 暴君角龍β
1 暴君角龍頭盔β				3 0 0 集中 +1
2 暴君角龍鎧甲β				2 1 0 怨恨 +1
3 暴君角龍腕甲β				2 1 0 集中 +1
4 暴君角龍腰甲β				2 0 0 怨恨 +1
5 暴君角龍護腿β				2 0 0 通常彈・通常箭強化 +1 
@bonus 爆鎚龍的守護
@resistences 4 -3 1 -2 -2
@set 爆鎚龍α
1 爆鎚龍頭盔α 				3 0 0 雷耐性 +2
2 爆鎚龍鎧甲α 				1 0 0 破壞王 +2
3 爆鎚龍腕甲α 				1 0 0 防禦性能 +1 防禦 +1
4 爆鎚龍腰甲α 				1 1 0 破壞王 +1 雷耐性 +1
5 爆鎚龍護腿α 				1 0 0 防禦性能 +2
@set 爆鎚龍β
1 爆鎚龍頭盔β 				3 1 0 雷耐性 +1
2 爆鎚龍鎧甲β 				3 0 0 破壞王 +1
3 爆鎚龍腕甲β 				2 0 0 防禦性能 +1
4 爆鎚龍腰甲β 				2 1 0 破壞王 +1
5 爆鎚龍護腿β 				3 0 0 防禦性能 +1
@bonus 爆鱗龍的守護
@resistences 3 1 -4 -2 -2
@set 爆鱗龍α
1 爆鱗龍頭盔α					2 0 0 耳塞 +2 爆破屬性強化 +1
2 爆鱗龍鎧甲α					0 0 0 防禦性能 +2 爆破異常狀態的耐性 +2
3 爆鱗龍腕甲α					0 0 0 拔刀術【技】 +2 耳塞 +1
4 爆鱗龍腰甲α					1 0 0 耳塞 +2 跳躍鐵人 +1
5 爆鱗龍護腿α					1 0 0 炸彈客 +2 拔刀術【技】 +1
@set 爆鱗龍β
1 爆鱗龍頭盔β					3 1 0 耳塞 +2
2 爆鱗龍鎧甲β					1 1 0 防禦性能 +2
3 爆鱗龍腕甲β					3 0 0 拔刀術【技】 +2
4 爆鱗龍腰甲β					3 0 0 耳塞 +2
5 爆鱗龍護腿β					3 0 0 炸彈客 +2 
@bonus 无
@resistences 4 -2 0 0 0
@set 大馬士革α
1 大馬士革頭盔α				1 0 0 防禦 +2 砥石使用高速化 +1
2 大馬士革鎧甲α				1 0 0 集中 +2 防禦 +2
3 大馬士革腕甲α				0 0 0 匠 +1 砥石使用高速化 +1
4 大馬士革腰甲α				1 0 0 集中 +1 防御力DOWN耐性 +2
5 大馬士革護腿α				1 0 0 防禦 +2 防御力DOWN耐性 +1
@set 大馬士革β
1 大馬士革頭盔β 				3 0 0 防禦 +2
2 大馬士革鎧甲β 				1 1 1 集中 +2
3 大馬士革腕甲β 				1 0 0 匠 +1
4 大馬士革腰甲β 				1 1 1 集中 +1
5 大馬士革護腿β 				3 0 0 防禦 +2 
@bonus 无
@resistences -2 0 -1 -1 4
@set 杜賓α
1 杜賓頭盔α					0 0 0 屬性解放／裝填擴充 +1 龍耐性 +1
2 杜賓鎧甲α					0 0 0 攻擊 +2 最愛菇類 +1
3 杜賓腕甲α					0 0 0 耐力急速回復 +2 最愛菇類 +1
4 杜賓腰甲α					0 0 0 龍耐性 +2 攻擊 +1
5 杜賓護腿α					0 0 0 攻擊 +2 耐力急速回復 +1
@set 杜賓β
1 杜賓頭盔β					1 0 0 屬性解放／裝填擴充 +1
2 杜賓鎧甲β					3 0 0 攻擊 +2
3 杜賓腕甲β					1 1 0 耐力急速回復 +1 最愛菇類 +1
4 杜賓腰甲β					3 0 0 龍耐性 +2
5 杜賓護腿β					1 0 0 攻擊 +2
@bonus 无
@resistences 3 2 -2 3 -4
@set 死神α
1 死神首腦α					2 0 0 死裡逃生 +1 看破 +1
2 死神肌肉α					0 0 0 不屈 +1 屬性解放／裝填擴充 +1
3 死神雙手α					1 0 0 集中 +2 龍屬性攻擊強化 +1
4 死神臍帶α					0 0 0 龍屬性攻擊強化 +2 集中 +1
5 死神腳跟α					0 0 0 匠 +2 龍屬性攻擊強化 +2
@set 死神β
1 死神首腦β					3 0 0 死裡逃生 +1
2 死神肌肉β					3 0 0 不屈 +1
3 死神雙手β					1 1 0 集中 +2
4 死神臍帶β					1 1 0 龍屬性攻擊強化 +2
5 死神腳跟β					1 1 0 匠 +2
@bonus 无
@resistences -3 -1 -1 -1 2
@set 无
1 骷髏面罩α					2 0 0 匠 +1

#----------------------------------------
@rare 8
@bonus 滅盡龍之飢餓
@resistences 1 1 -3 1 -3
@set 戰紋α
1 戰紋頭盔α					1 0 0 精神抖擻 +2 攻擊 +1
2 戰紋鎧甲α					1 0 0 耐力急速回復 +2 挑戰者 +1
3 戰紋腕甲α					0 0 0 挑戰者 +2 攻擊 +1
4 戰紋腰甲α					0 0 0 攻擊 +2 耐力急速回復 +1
5 戰紋護腿α					1 0 0 精神抖擻 +1 挑戰者 +1
@set 戰紋β
1 戰紋頭盔β					1 1 0 精神抖擻 +2
2 戰紋鎧甲β					2 1 0 耐力急速回復 +2
3 戰紋腕甲β					1 0 0 挑戰者 +2
4 戰紋腰甲β					2 0 0 攻擊 +2
5 戰紋護腿β					2 0 0 精神抖擻 +1
@bonus 炎王龍之武技
@resistences 3 -3 1 -3 1
@set 帝王α
1 帝王皇冠α					0 0 0 力量解放 +2
2 帝王鎧甲α					0 0 0 特殊射擊強化 +2 力量解放 +1
3 帝王腕甲α					1 0 0 弱點特效 +2
4 帝王腰甲α					0 0 0 爆破屬性強化 +2 弱點特效 +1
5 帝王護腿α					0 0 0 力量解放 +2 爆破屬性強化 +1
@set 帝王β
1 帝王皇冠β					2 0 0 力量解放 +1
2 帝王鎧甲β					1 1 0 特殊射擊強化 +2
3 帝王腕甲β					3 0 0 弱點特效 +1
4 帝王腰甲β					2 0 0 爆破屬性強化 +2
5 帝王護腿β					1 0 0 力量解放 +2
@bonus 鋼龍之飛翔
@resistences 0 2 -3 4 -2
@set 鋼龍α
1 鋼龍強力α					0 0 0 冰屬性攻擊強化 +2 匠 +1
2 鋼龍恐懼α					0 0 0 匠 +2 集中 +1
3 鋼龍剛強α					0 0 0 迴避性能 +2 匠 +1
4 鋼龍安穩α					0 0 0 冰屬性攻擊強化 +2 迴避距離UP +1
5 鋼龍踏實α					0 0 0 迴避距離UP +2 匠 +1
@set 鋼龍β
1 鋼龍強力β					1 1 1 冰屬性攻擊強化 +2
2 鋼龍恐懼β					2 0 0 匠 +2
3 鋼龍剛強β					3 0 0 迴避性能 +2
4 鋼龍安穩β					1 1 0 冰屬性攻擊強化 +2
5 鋼龍踏實β					3 0 0 迴避距離UP +2
@bonus 屍套龍之命脈
@resistences -4 4 1 -1 -3
@set 烏爾德α
1 烏爾德頭盔α					0 0 0 無傷 +1 龍屬性攻擊強化 +2
2 烏爾德鎧甲α					1 0 0 回復速度 +2 龍屬性攻擊強化 +1
3 烏爾德腕甲α					1 0 0 無傷 +1 回復速度 +1
4 烏爾德腰甲α					1 0 0 無傷 +1 瘴氣耐性 +1
5 烏爾德護腿α					1 0 0 瘴氣耐性 +2 龍屬性攻擊強化 +1
@set 烏爾德β
1 烏爾德頭盔β					1 0 0 無傷 +1
2 烏爾德鎧甲β					1 1 0 回復速度 +2
3 烏爾德腕甲β					1 1 1 無傷 +1
4 烏爾德腰甲β					1 1 0 無傷 +1
5 烏爾德護腿β					1 1 0 瘴氣耐性 +2
@bonus 麒麟之恩寵
@resistences -3 -2 4 -2 2
@set 麒麟α
1 麒麟角α						0 0 0 跑者 +2 精靈加護 +1
2 麒麟服飾α					0 0 0 精靈加護 +2 雷屬性攻擊強化 +1
3 麒麟長腕甲α					0 0 0 雷屬性攻擊強化 +2 跑者 +1
4 麒麟腰環α					0 0 0 屬性異常狀態耐性 +1 屬性解放／裝填擴充 +1
5 麒麟護脛α					0 0 0 屬性解放／裝填擴充 +2 雷耐性 +2
@set 麒麟β
1 麒麟角β						1 0 0 跑者 +2
2 麒麟服飾β					1 0 0 精靈加護 +2
3 麒麟長腕甲β					1 1 0 雷屬性攻擊強化 +2
4 麒麟腰環β					1 1 1 屬性異常狀態耐性 +1
5 麒麟護脛β					1 1 0 屬性解放／裝填擴充 +2
@bonus 冥燈龍的神秘
@resistences -3 2 2 2 -4
@set 冥燈幽火α
1 冥燈幽火頭飾α				1 0 0 減輕膽怯 +1 特殊射擊強化 +1
2 冥燈幽火皮α					1 0 0 強化持續 +2 屬性異常狀態耐性 +1
3 冥燈幽火鋼爪α				1 0 0 減輕膽怯 +1 超會心 +1
4 冥燈幽火脊椎α				2 0 0 屬性異常狀態耐性 +2 特殊射擊強化 +1
5 冥燈幽火靴α					1 0 0 減輕膽怯 +1 強化持續 +1
@set 冥燈幽火β
1 冥燈幽火頭飾β				2 0 0 減輕膽怯 +1
2 冥燈幽火皮β					1 1 0 強化持續 +2
3 冥燈幽火鋼爪β				3 0 0 減輕膽怯 +1
4 冥燈幽火脊椎β				2 1 0 屬性異常狀態耐性 +2
5 冥燈幽火靴β					1 1 1 減輕膽怯 +1
@bonus 公會的指引
@resistences 0 0 0 0 0
@set 公會十字α
1 公會十字頭飾α				1 0 0 精靈加護 +2 雷耐性 +2
2 公會十字戰衣α				1 0 0 死裡逃生 +1 冰耐性 +2
3 公會十字腕甲α				1 0 0 整備 +1 水耐性 +2
4 公會十字腰甲α				1 0 0 不屈 +1 龍耐性 +2
5 公會十字靴α					1 0 0 飛燕 +1 火耐性 +2
@set 公會十字β
1 公會十字頭飾β				1 1 1 精靈加護 +2
2 公會十字戰衣β				3 0 0 死裡逃生 +1
3 公會十字腕甲β				3 0 0 整備 +1
4 公會十字腰甲β				1 1 1 不屈 +1
5 公會十字靴β					3 0 0 飛燕 +1
@bonus 无
@resistences 0 0 0 0 0
@set 无
1 龍王的獨眼α					3 0 0 弱點特效 +2
@bonus 調查團的指引
@resistences 2 2 2 2 2
@set 追蹤者α
1 追蹤者頭飾α					1 0 0 整備 +1 採集達人 +1
2 追蹤者服飾α					0 0 0 廣域化 +2 攀岩者 +1
3 追蹤者手套α					1 0 0 閃光強化 +1 剝取鐵人 +1
4 追蹤者皮帶α					1 0 0 最愛菇類 +1 搬運達人 +1
5 追蹤者長褲α					0 0 0 潛伏 +2 滑走強化 +1
@set 追蹤者β
1 追蹤者頭飾β					2 0 0 整備 +1
2 追蹤者服飾β					1 0 0 廣域化 +2
3 追蹤者手套β					2 0 0 閃光強化 +1
4 追蹤者皮帶β					2 0 0 最愛菇類 +1
5 追蹤者長褲β					2 0 0 潛伏 +2

#----------------------------------------
@rare 7
@bonus 无
@resistences 1 1 -3 2 -3
@set 殘虐α
1 殘虐頭盔α					1 0 0 破壞王 +1 匠 +1
2 殘虐鎧甲α					2 0 0 快吃 +1 匠 +1
3 殘虐腕甲α					0 0 0 力量解放 +2 破壞王 +1
4 殘虐腰甲α					1 0 0 力量解放 +1 匠 +1
5 殘虐護腿α					0 0 0 快吃 +2 破壞王 +1
@set 殘虐β
1 殘虐頭盔β					3 1 0 破壞王 +1
2 殘虐鎧甲β					3 0 0 快吃 +1
3 殘虐腕甲β					2 0 0 力量解放 +2
4 殘虐腰甲β					3 1 0 力量解放 +1
5 殘虐護腿β					1 1 0 快吃 +2

#----------------------------------------
@rare 8
@bonus 无
@resistences 4 -2 3 4 -2
@set 絢輝龍鎧羅α
1 絢輝龍鎧羅頭盔α				1 0 0 屬性解放／裝填擴充 +1 挑戰者 +2
2 絢輝龍鎧羅鎧甲α				1 0 0 昏厥耐性 +2 超會心 +2
3 絢輝龍鎧羅腕甲α				1 0 0 屬性解放／裝填擴充 +1 強化持續 +2
4 絢輝龍鎧羅腰甲α				1 0 0 屬性解放／裝填擴充 +1 匠 +2
5 絢輝龍鎧羅護腿α				1 0 0 廣域化 +2 無傷 +2
@set 絢輝龍鎧羅β
1 絢輝龍鎧羅頭盔β				2 1 0 屬性解放／裝填擴充 +1 挑戰者 +1
2 絢輝龍鎧羅鎧甲β				3 1 0 昏厥耐性 +2 超會心 +1
3 絢輝龍鎧羅腕甲β				3 1 0 屬性解放／裝填擴充 +1 強化持續 +1
4 絢輝龍鎧羅腰甲β				3 1 0 屬性解放／裝填擴充 +1 匠 +1
5 絢輝龍鎧羅護腿β				2 1 0 廣域化 +2 無傷 +1
@bonus 炎妃龍的恩寵
@resistences 3 1 1 -3 -2
@set 皇后α
1 皇后琴弦α					3 1 0 迴避距離UP +2 整備 +1
2 皇后鎧甲α					1 1 0 無傷 +2 體力增強 +1
3 皇后腕甲α					3 0 0 廣域化 +2 爆破屬性強化 +2
4 皇后腰甲α					2 1 0 整備 +2 爆破屬性強化 +1
5 皇后護腿α					2 1 0 體力增強 +2 廣域化 +2
@set 皇后β
1 皇后琴弦β					3 2 0 迴避距離UP +2
2 皇后鎧甲β					1 1 1 無傷 +2
3 皇后腕甲β					3 2 0 廣域化 +2
4 皇后腰甲β					2 2 0 整備 +2
5 皇后護腿β					2 2 0 體力增強 +2
@bonus 无
@resistences 0 0 0 0 0
@set 无

#----------------------------------------
@rare 5
@bonus 无
@resistences 1 1 4 1 1
@set 巴魯特α
1 巴魯特頭飾α					1 1 0 蜂蜜獵人 +1
2 巴魯特服飾α					1 1 0 收刀術 +1
3 巴魯特手套α					1 1 0 麻痺耐性 +1
4 巴魯特風衣α					1 1 0 導蟲反應距離UP +1
5 巴魯特靴α					1 1 0 回復速度 +1
@bonus 无
@resistences 1 4 1 1 1
@set 潛水夫α
1 潛水夫修羅α					2 0 0 跑者 +1
2 潛水夫服裝α					2 0 0 看破 +1
3 潛水夫腕甲α					2 0 0 收刀術 +1
4 潛水夫皮帶α					2 0 0 適應水場・深雪 +1
5 潛水夫靴α					2 0 0 飢餓耐性 +1

@rare 6
@bonus 无
@resistences 4 1 1 1 1
@set 收獲α
1 收獲頭飾α					2 1 0 集中 +1
2 收獲裝甲α					2 1 0 耐震 +1
3 收獲手套α					2 1 0 怨恨 +1
4 收獲護裙α					2 1 0 體術 +1
5 收獲護腿α					2 1 0 最愛菇類 +1
@bonus 无
@resistences 1 1 1 4 1
@set 獵戶星α
1 獵戶星頭飾α					3 1 0 體力回復量UP +1
2 獵戶星服飾α					3 0 0 減輕膽怯 +1
3 獵戶星腕甲α					3 1 0 風壓耐性 +1
4 獵戶星風衣α					3 1 0 體力增強 +1
5 獵戶星靴α					3 1 0 火場怪力 +1

@rare 7
@bonus 星辰的祝福
@resistences 1 1 1 1 4
@set 盛裝α
1 盛裝頭飾α					2 1 1 超會心 +1
2 盛裝服飾α					2 1 1 拔刀術【技】 +1
3 盛裝手套α					2 1 1 精神抖擻 +1
4 盛裝護裙α					3 1 1 投射器裝填數UP +1
5 盛裝靴α						3 1 1 精靈加護 +1

@rare 5
@bonus 无
@resistences -1 -1 2 0 2
@set 獨角仙后α
1 獨角仙后護頭α				1 0 0 昏厥耐性 +2 防禦 +1
2 獨角仙后上身α				0 0 0 體力增強 +2 昏厥耐性 +1
3 獨角仙后護袖α				0 0 0 看破 +2 體力增強 +1
4 獨角仙后護腰具α				1 0 0 防禦 +2 跑者 +1
5 獨角仙后後腳α				0 0 0 跑者 +2 看破 +1
@set 獨角仙后β
1 獨角仙后護頭β				2 0 0 昏厥耐性 +2
2 獨角仙后上身β				1 0 0 體力增強 +2
3 獨角仙后護袖β				1 0 0 看破 +2
4 獨角仙后護腰具β				3 0 0 防禦 +2
5 獨角仙后後腳β				1 0 0 跑者 +2

#----------------------------------------
@rare 8
@bonus 屍套龍之命脈
@resistences -4 4 1 -1 -3
@set 烏爾德λ
1 烏爾德頭盔λ					3 0 0 體力回復量UP +2 龍屬性攻擊強化 +1
2 烏爾德鎧甲λ					3 0 0 無傷 +1 體力回復量UP +1
3 烏爾德腕甲λ					3 2 0 龍屬性攻擊強化 +3
4 烏爾德腰甲λ					2 1 1 回復速度 +2 龍屬性攻擊強化 +1
5 烏爾德護腿λ					3 1 0 無傷 +1 回復速度 +1
@bonus 麒麟之恩寵
@resistences -3 -2 4 -2 2
@set 麒麟λ
1 麒麟角λ						2 0 0 屬性異常狀態耐性 +1 雷屬性攻擊強化 +3
2 麒麟服飾λ					1 1 0 屬性解放／裝填擴充 +2
3 麒麟長腕甲λ					2 2 0 屬性異常狀態耐性 +1 屬性解放／裝填擴充 +1
4 麒麟腰環λ					1 1 0 跑者 +2
5 麒麟護脛λ					3 0 0 屬性異常狀態耐性 +1 雷屬性攻擊強化 +2
@bonus 炎王龍之武技
@resistences 3 -3 1 -3 1
@set 帝王λ
1 帝王皇冠λ					2 2 0 看破 +2
2 帝王鎧甲λ					2 0 0 力量解放 +2 弱點特效 +1
3 帝王腕甲λ					3 0 0 看破 +3
4 帝王腰甲λ					1 1 0 力量解放 +3
5 帝王護腿λ					3 1 0 看破 +2
@bonus 鋼龍之飛翔
@resistences 0 2 -3 4 -2
@set 鋼龍λ
1 鋼龍強力λ					2 0 0 匠 +2
2 鋼龍恐懼λ					2 0 0 冰屬性攻擊強化 +3 迴避距離UP +1
3 鋼龍剛強λ					1 1 1 集中 +2 
4 鋼龍安穩λ					1 1 0 匠 +2
5 鋼龍踏實λ					3 0 0 迴避性能 +2
@bonus 滅盡龍之飢餓
@resistences 1 1 -3 1 -3
@set 戰紋λ
1 戰紋頭盔λ					2 2 0 耐力急速回復 +1 挑戰者 +1
2 戰紋鎧甲λ					3 2 1 精神抖擻 +1
3 戰紋腕甲λ					2 1 1 破壞王 +1 攻擊 +1
4 戰紋腰甲λ					3 1 0 精神抖擻 +1 挑戰者 +1
5 戰紋護腿λ					2 2 0 攻擊 +3
@bonus 熔山龍的奧秘
@resistences 4 -3 -1 -2 -3
@set 鑄島熔岩λ
1 鑄島熔岩頭飾λ 				2 0 0 風壓耐性 +2 看破 +2
2 鑄島熔岩皮λ 				1 1 1 耐震 +2
3 鑄島熔岩鋼爪λ 				3 1 0 耳塞 +2
4 鑄島熔岩脊椎λ 				3 2 0 炸彈客 +2 看破 +1
5 鑄島熔岩靴λ 				3 2 0 爆破屬性強化 +2 看破 +1
@bonus 冥燈龍的神秘
@resistences -3 2 2 2 -4
@set 冥燈幽火λ
1 冥燈幽火頭飾λ				2 1 1 屬性異常狀態耐性 +2 強化持續 +1
2 冥燈幽火皮λ					1 1 0 減輕膽怯 +2
3 冥燈幽火鋼爪λ				2 2 1 強化持續 +1 特殊射擊強化 +1
4 冥燈幽火脊椎λ				3 1 0 超會心 +1
5 冥燈幽火靴λ					2 1 1 超會心 +1
@bonus 炎妃龍的恩寵
@resistences 3 1 1 -3 -2
@set 皇后λ
1 皇后琴弦λ					1 1 1 廣域化 +2 無傷 +1
2 皇后鎧甲λ					3 0 0 耳塞 +2 整備 +1
3 皇后腕甲λ					3 1 0 挑戰者 +2 迴避性能 +1
4 皇后腰甲λ					3 0 0 迴避性能 +2 體力增強 +2
5 皇后護腿λ					3 0 0 耳塞 +2 挑戰者 +1
@bonus 无
@resistences 4 -2 3 4 -2
@set 絢輝龍鎧羅λ
1 絢輝龍鎧羅頭盔λ				3 1 1 強化持續 +1 昏厥耐性 +1
2 絢輝龍鎧羅鎧甲λ				1 0 0 匠 +2 挑戰者 +1
3 絢輝龍鎧羅腕甲λ				1 0 0 匠 +2 體術 +1
4 絢輝龍鎧羅腰甲λ				3 0 0 超會心 +1 弱點特效 +1
5 絢輝龍鎧羅護腿λ				3 1 0 挑戰者 +2 熱傷害無效 +1

@rare 7
@bonus 火龍奧祕
@resistences 2 2 0 0 3
@set 蒼星之將α
1 蒼星之將【頭盔】α			3 0 0 挑戰者 +1
2 蒼星之將【鎧甲】α			2 0 0 匠 +1
3 蒼星之將【腕甲】α			3 0 0 體力回復量UP +1
4 蒼星之將【腰甲】α			2 0 0 匠 +1
5 蒼星之將【護腿】α			3 0 0 超會心 +1
@rare 8
@bonus 无
@resistences 3 -3 3 -3 3
@set 但丁α
1 但丁假髮α					1 0 0 弱點特效 +1 看破 +1
2 但丁風衣α					3 0 0 迴避性能 +1 看破 +1
3 但丁手套α					3 0 0 迴避性能 +1 特殊射擊強化 +1
4 但丁皮带α					3 0 0 迴避性能 +1 力量解放 +1
5 但丁皮裤靴α					1 1 0 弱點特效 +2

@bonus 龍騎士之證
@resistences -2 -2 3 -2 4
@set 騰龍α
1 騰龍戰盔α					3 1 0 超會心 +1 飛燕 +1
2 騰龍戰鎧α					3 0 0 看破 +2 超會心 +1
3 騰龍腕甲α					2 2 0 看破 +2 攻擊 +1
4 騰龍腰甲α					3 0 0 看破 +2 強化持續 +1
5 騰龍護腿α					2 0 0 攻擊 +2 超會心 +1

#----------------------------------------
@rare 5
@bonus 无
@set 无
@resistences 3 2 0 2 0
1 封印的眼罩α					2 1 0 火耐性 +1
@resistences 4 0 4 2 0
1 墨镜α						1 1 1 昏厥耐性 +1
@resistences 2 0 2 3 2
1 扒手龍頭套α					3 1 0 搬運達人 +1
@resistences 0 4 0 0 4
1 搖曳鰻頭套α					1 1 0 廣域化 +2

#----------------------------------------
# unknown
@bonus 无
@set 无
@resistences 3 2 0 2 0
1 龍封的耳環α					2 1 0 龍封力強化 +1 
`


	const rawDataMaster = `
#----------------------------------------
@rare 9
@bonus 无
@resistences 2 0 2 0 2
@set 精英・骨製α
1 精英・骨製頭盔α					3 0 0 體力增強 +2 破壞王 +1
2 精英・骨製鎧甲α					2 0 0 攻擊 +2 體力增強 +1
3 精英・骨製腕甲α					2 0 0 KO術 +2 攻擊 +1
4 精英・骨製腰甲α					3 0 0 吹笛名人 +1 破壞王 +1
5 精英・骨製護腿α					3 0 0 KO術 +1 吹笛名人 +1
@set 精英・骨製β
1 精英・骨製頭盔β					4 0 0 體力增強 +1 破壞王 +1
2 精英・骨製鎧甲β					4 1 0 攻擊 +1
3 精英・骨製腕甲β					4 1 0 KO術 +1
4 精英・骨製腰甲β					4 1 0 吹笛名人 +1
5 精英・骨製護腿β					4 0 0 KO術 +1

@resistences -2 0 -2 -2 0
@set 精英・合金α
1 精英・合金頭盔α					2 0 0 風壓耐性 +2 防禦 +1
2 精英・合金鎧甲α					3 0 0 水耐性 +2 防禦 +1
3 精英・合金腕甲α					3 0 0 防禦 +2 砥石使用高速化 +1
4 精英・合金腰甲α					3 0 0 毒耐性 +2 風壓耐性 +1
5 精英・合金護腿α					3 0 0 砥石使用高速化 +2 風壓耐性 +1
@set 精英・骨製β
1 精英・合金頭盔β					4 1 0 風壓耐性 +1
2 精英・合金鎧甲β					4 1 0 水耐性 +1
3 精英・合金腕甲β					4 1 0 防禦 +1
4 精英・合金腰甲β					4 0 0 毒耐性 +1 風壓耐性 +1
5 精英・合金護腿β					4 0 0 砥石使用高速化 +1 風壓耐性 +1

@resistences -2 1 1 1 2
@set 精英・巨蜂α
1 精英・巨蜂頭盔α					3 0 0 收刀術 +1 麻痺屬性強化 +1
2 精英・巨蜂鎧甲α					2 1 0 風壓耐性 +2
3 精英・巨蜂腕甲α					3 0 0 麻痺屬性強化 +2 收刀術 +1
4 精英・巨蜂腰甲α					3 0 0 麻痺耐性 +2 收刀術 +1
5 精英・巨蜂護腿α					3 0 0 拔刀術【技】 +1 麻痺耐性 +1
@set 精英・巨蜂β
1 精英・巨蜂頭盔β					4 1 0 收刀術 +1
2 精英・巨蜂鎧甲β					4 1 0 風壓耐性 +1
3 精英・巨蜂腕甲β					4 1 0 麻痺屬性強化 +1
4 精英・巨蜂腰甲β					4 1 0 麻痺耐性 +1
5 精英・巨蜂護腿β					4 1 0 拔刀術【技】 +1

@resistences -1 -1 0 0 2
@set 精英・巨甲蟲α
1 精英・巨甲蟲頭盔α					2 0 0 弱點特效 +1 龍屬性攻擊強化 +2
2 精英・巨甲蟲鎧甲α					2 1 0 適應瘴氣環境 +1 飢餓耐性 +2
3 精英・巨甲蟲腕甲α					3 0 0 滿足感 +1 匠 +1
4 精英・巨甲蟲腰甲α					2 0 0 弱點特效 +1 飢餓耐性 +1
5 精英・巨甲蟲護腿α					2 1 0 匠 +1 龍屬性攻擊強化 +1
@set 精英・巨甲蟲β
1 精英・巨甲蟲頭盔β					4 0 0 弱點特效 +1 龍屬性攻擊強化 +1
2 精英・巨甲蟲鎧甲β					4 2 1 適應瘴氣環境 +1
3 精英・巨甲蟲腕甲β					4 2 0 滿足感 +1
4 精英・巨甲蟲腰甲β					4 1 0 弱點特效 +1
5 精英・巨甲蟲護腿β					4 1 0 匠 +1

@set 无
@resistences 4 0 0 0 0
3 精英・冠突龍護手α					1 1 0 滑走強化 +1 集中 +2
3 精英・冠突龍護手β					4 1 0 滑走強化 +1 集中 +1

@resistences 0 5 0 0 0
5 精英・咬魚靴α						2 1 0 適應水場・深雪 +2 水屬性攻擊強化 +2
5 精英・咬魚靴β						4 1 0 適應水場・深雪 +1 水屬性攻擊強化 +1

@resistences 2 2 0 -3 0
1 精英・猫蜥龍護目鏡α					2 1 0 察覺 +1 地質學 +2
1 精英・猫蜥龍護目鏡β					4 2 0 察覺 +1 地質學 +1

@resistences 3 0 0 0 0
1 精英・猫蜥龍角α						1 0 0 減輕膽怯 +2 爆破異常狀態的耐性 +1
1 精英・猫蜥龍角β						4 1 0 減輕膽怯 +1 爆破異常狀態的耐性 +1

@resistences 1 1 0 1 -2
2 精英・酸翼龙斗篷α					2 2 0 熱傷害無效 +1 防御力DOWN耐性 +2
2 精英・酸翼龙斗篷β					4 2 0 熱傷害無效 +1 防御力DOWN耐性 +1

@resistences -3 2 -2 3 2
1 精英・冰豺龍圍巾α					2 1 0 冰耐性 +2 騎乘名人 +1
1 精英・冰豺龍圍巾β					4 1 0 冰耐性 +1 騎乘名人 +1

@resistences -3 2 0 2 0
2 精英・冬翼龙斗篷α					1 1 0 飢餓耐性 +2 跳躍鐵人 +1
2 精英・冬翼龙斗篷β					4 0 0 飢餓耐性 +1 跳躍鐵人 +1

@resistences -2 2 -1 -1 1
@set 精英・凶豺龍α
1 精英・凶豺龍頭盔α					2 0 0 快吃 +2 攻擊 +2
2 精英・凶豺龍鎧甲α					3 0 0 迴避距離UP +1 攻擊 +2
3 精英・凶豺龍腕甲α					2 0 0 迴避距離UP +2 體力回復量UP +1
4 精英・凶豺龍腰甲α					2 1 0 體力回復量UP +1 快吃 +1
5 精英・凶豺龍護腿α					2 1 0 滿足感 +1 體力回復量UP +1
@set 精英・凶豺龍β
1 精英・凶豺龍頭盔β					4 1 0 快吃 +1 攻擊 +1
2 精英・凶豺龍鎧甲β					4 0 0 迴避距離UP +1 攻擊 +1
3 精英・凶豺龍腕甲β					4 0 0 迴避距離UP +1 體力回復量UP +1
4 精英・凶豺龍腰甲β					4 1 0 體力回復量UP +1
5 精英・凶豺龍護腿β					4 1 0 滿足感 +1

@resistences 0 0 -3 -2 0
@set 精英・眩鳥α
1 精英・眩鳥頭盔α						2 1 0 屬性解放／裝填擴充 +1 昏厥耐性 +1
2 精英・眩鳥鎧甲α						1 1 0 體術 +2 水屬性攻擊強化 +2
3 精英・眩鳥腕甲α						2 0 0 昏厥耐性 +2 廣域化 +2
4 精英・眩鳥腰甲α						2 0 0 廣域化 +2 水屬性攻擊強化 +2
5 精英・眩鳥護腿α						3 0 0 睡眠耐性 +2 廣域化 +1
@set 精英・眩鳥β
1 精英・眩鳥頭盔β						4 1 0 屬性解放／裝填擴充 +1
2 精英・眩鳥鎧甲β						4 1 0 體術 +1 水屬性攻擊強化 +1
3 精英・眩鳥腕甲β						4 0 0 昏厥耐性 +2 廣域化 +1
4 精英・眩鳥腰甲β						4 1 0 廣域化 +2
5 精英・眩鳥護腿β						4 0 0 睡眠耐性 +1 廣域化 +1

@resistences 0 -3 2 0 1
@set 精英・凶顎龍α
1 精英・凶顎龍頭盔α					2 0 0 吹笛名人 +2 麻痺耐性 +1
2 精英・凶顎龍鎧甲α					2 0 0 麻痺耐性 +2 屬性解放／裝填擴充 +1
3 精英・凶顎龍腕甲α					1 0 0 屬性解放／裝填擴充 +1 瘴氣耐性 +2
4 精英・凶顎龍腰甲α					3 0 0 適應瘴氣環境 +1 麻痺屬性強化 +2
5 精英・凶顎龍護腿α					1 0 0 麻痺屬性強化 +2 屬性解放／裝填擴充 +1
@set 精英・凶顎龍β
1 精英・凶顎龍頭盔β					4 0 0 吹笛名人 +2
2 精英・凶顎龍鎧甲β					4 2 0 麻痺耐性 +2
3 精英・凶顎龍腕甲β					4 0 0 屬性解放／裝填擴充 +1 瘴氣耐性 +1
4 精英・凶顎龍腰甲β					4 2 0 適應瘴氣環境 +1
5 精英・凶顎龍護腿β					4 0 0 麻痺屬性強化 +2

@resistences 2 0 -3 0 2
@set 精英・岩賊龍α
1 精英・岩賊龍頭盔α					3 0 0 爆破異常狀態的耐性 +2 炸彈客 +1
2 精英・岩賊龍鎧甲α					2 0 0 爆破屬性強化 +2 砲術 +1
3 精英・岩賊龍腕甲α					2 0 0 炸彈客 +2 爆破屬性強化 +1
4 精英・岩賊龍腰甲α					2 1 0 砲術 +2 爆破異常狀態的耐性 +1
5 精英・岩賊龍護腿α					2 1 0 砲彈裝填數UP +1 爆破屬性強化 +1
@set 精英・岩賊龍β
1 精英・岩賊龍頭盔β					4 0 0 爆破異常狀態的耐性 +2
2 精英・岩賊龍鎧甲β					4 0 0 爆破屬性強化 +2
3 精英・岩賊龍腕甲β					4 0 0 炸彈客 +1 爆破屬性強化 +1
4 精英・岩賊龍腰甲β					4 1 0 砲術 +2
5 精英・岩賊龍護腿β					4 1 0 砲彈裝填數UP +1

@resistences 0 -3 0 1 0
@set 精英・搔鳥α
1 精英・搔鳥頭盔α						1 0 0 投射器裝填數UP +2 超會心 +1
2 精英・搔鳥鎧甲α						2 0 0 耐力急速回復 +1 看破 +2
3 精英・搔鳥腕甲α						1 1 0 超會心 +1 搬運達人 +1
4 精英・搔鳥腰甲α						3 0 0 道具使用強化 +2 看破 +1
5 精英・搔鳥護腿α						2 0 0 看破 +2 道具使用強化 +1
@set 精英・搔鳥β
1 精英・搔鳥頭盔β						4 0 0 投射器裝填數UP +2
2 精英・搔鳥鎧甲β						4 0 0 耐力急速回復 +1 看破 +1
3 精英・搔鳥腕甲β						4 0 0 超會心 +1
4 精英・搔鳥腰甲β						4 1 0 道具使用強化 +2
5 精英・搔鳥護腿β						4 0 0 看破 +1 道具使用強化 +1

@resistences 0 3 -3 0 1
@set 精英・毒妖鳥α
1 精英・毒妖鳥頭盔α					2 2 0 環境利用知識 +2 毒耐性 +1
2 精英・毒妖鳥鎧甲α					2 0 0 道具使用強化 +2 無傷 +1
3 精英・毒妖鳥腕甲α					1 0 0 無傷 +2 環境利用知識 +1
4 精英・毒妖鳥腰甲α					3 0 0 毒屬性強化 +2 道具使用強化 +2
5 精英・毒妖鳥護腿α					3 0 0 毒耐性 +2 毒屬性強化 +2
@set 精英・毒妖鳥β
1 精英・毒妖鳥頭盔β					4 1 1 環境利用知識 +2
2 精英・毒妖鳥鎧甲β					4 0 0 道具使用強化 +1 無傷 +1
3 精英・毒妖鳥腕甲β					4 0 0 無傷 +1 環境利用知識 +1
4 精英・毒妖鳥腰甲β					4 1 0 毒屬性強化 +1 道具使用強化 +1
5 精英・毒妖鳥護腿β					4 2 0 毒耐性 +2

@resistences 0 3 -2 -3 0
@set 精英・妖水α
1 精英・妖水頭盔α						1 0 0 拔刀術【技】 +2 道具使用強化 +1
2 精英・妖水鎧甲α						2 0 0 強化持續 +1 拔刀術【技】 +1
3 精英・妖水腕甲α						1 0 0 破壞王 +1 強化持續 +1
4 精英・妖水腰甲α						2 0 0 水屬性攻擊強化 +2 破壞王 +1
5 精英・妖水護腿α						1 0 0 道具使用強化 +2 水屬性攻擊強化 +2
@set 精英・妖水β
1 精英・妖水頭盔β						4 0 0 拔刀術【技】 +1 道具使用強化 +1
2 精英・妖水鎧甲β						4 1 0 強化持續 +1
3 精英・妖水腕甲β						4 1 0 破壞王 +1
4 精英・妖水腰甲β						4 0 0 水屬性攻擊強化 +1 破壞王 +1
5 精英・妖水護腿β						4 1 0 道具使用強化 +2

@resistences -3 -1 3 -1 0
@set 精英・土砂龍α
1 精英・土砂龍頭盔α					2 0 0 防禦性能 +2 跑者 +1
2 精英・土砂龍鎧甲α					1 1 0 奪取耐力 +2 挑戰者 +1
3 精英・土砂龍腕甲α					3 1 0 跑者 +1 防禦性能 +1
4 精英・土砂龍腰甲α					1 0 0 挑戰者 +2 防禦性能 +1
5 精英・土砂龍護腿α					3 1 0 昏厥耐性 +2 跑者 +1
@set 精英・土砂龍β
1 精英・土砂龍頭盔β					4 1 0 防禦性能 +2 跑者 +1
2 精英・土砂龍鎧甲β					4 2 0 奪取耐力 +2 挑戰者 +1
3 精英・土砂龍腕甲β					4 2 0 跑者 +1 防禦性能 +1
4 精英・土砂龍腰甲β					4 0 0 挑戰者 +2 防禦性能 +1
5 精英・土砂龍護腿β					4 2 1 昏厥耐性 +2 跑者 +1

@resistences -1 2 -3 0 0
@set 精英・泥魚龍α
1 精英・泥魚龍頭盔α					1 1 0 力量解放 +2 集中 +1
2 精英・泥魚龍鎧甲α					2 0 0 力量解放 +1 水屬性攻擊強化 +2
3 精英・泥魚龍腕甲α					2 1 0 水屬性攻擊強化 +2 冰耐性 +1
4 精英・泥魚龍腰甲α					3 0 0 冰耐性 +2 力量解放 +1
5 精英・泥魚龍護腿α					2 0 0 集中 +2 水屬性攻擊強化 +1
@set 精英・泥魚龍β
1 精英・泥魚龍頭盔β					4 1 0 力量解放 +1 集中 +1
2 精英・泥魚龍鎧甲β					4 0 0 力量解放 +1 水屬性攻擊強化 +1
3 精英・泥魚龍腕甲β					4 2 0 水屬性攻擊強化 +2
4 精英・泥魚龍腰甲β					4 1 0 冰耐性 +1
5 精英・泥魚龍護腿β					4 1 0 集中 +1 水屬性攻擊強化 +1

@resistences -3 0 -2 3 2
@set 精英・冰魚龍α
1 精英・冰魚龍頭盔α					2 0 0 適應水場・深雪 +2 耳塞 +1
2 精英・冰魚龍鎧甲α					3 0 0 耐力急速回復 +1 冰屬性攻擊強化 +2
3 精英・冰魚龍腕甲α					3 0 0 冰屬性攻擊強化 +2 體力增強 +1
4 精英・冰魚龍腰甲α					2 0 0 體力增強 +2 耳塞 +2
5 精英・冰魚龍護腿α					2 0 0 耳塞 +2 冰屬性攻擊強化 +1
@set 精英・冰魚龍β
1 精英・冰魚龍頭盔β					4 1 0 適應水場・深雪 +2
2 精英・冰魚龍鎧甲β					4 2 0 耐力急速回復 +1
3 精英・冰魚龍腕甲β					4 0 0 冰屬性攻擊強化 +2
4 精英・冰魚龍腰甲β					4 1 0 體力增強 +2 耳塞 +1
5 精英・冰魚龍護腿β					4 0 0 耳塞 +2

@resistences 0 -3 3 0 0
@set 精英・飛雷龍α
1 精英・飛雷龍頭盔α					2 0 0 體術 +2 迴避距離UP +1
2 精英・飛雷龍鎧甲α					2 1 0 跳躍鐵人 +1 體術 +1
3 精英・飛雷龍腕甲α					2 0 0 迴避距離UP +2 雷屬性攻擊強化 +2
4 精英・飛雷龍腰甲α					3 1 0 雷屬性攻擊強化 +2 雷耐性 +1
5 精英・飛雷龍護腿α					3 1 0 雷耐性 +2 體術 +1
@set 精英・飛雷龍β
1 精英・飛雷龍頭盔β					4 1 0 體術 +1 迴避距離UP +1
2 精英・飛雷龍鎧甲β					4 2 0 跳躍鐵人 +1
3 精英・飛雷龍腕甲β					4 2 0 迴避距離UP +1 雷屬性攻擊強化 +2
4 精英・飛雷龍腰甲β					4 1 0 雷屬性攻擊強化 +2
5 精英・飛雷龍護腿β					4 1 1 雷耐性 +2

@resistences 1 3 -3 -2 1
@set 精英・朱毒α
1 精英・朱毒頭盔α						1 0 0 迴避距離UP +2 麻痺屬性強化 +1
2 精英・朱毒鎧甲α						1 1 0 收刀術 +1 迴避距離UP +1
3 精英・朱毒腕甲α						2 0 0 毒屬性強化 +2 迴避性能 +1
4 精英・朱毒腰甲α						2 0 0 體術 +1 收刀術 +1
5 精英・朱毒護腿α						2 0 0 迴避性能 +1 體術 +1
@set 精英・朱毒β
1 精英・朱毒頭盔β						4 0 0 迴避距離UP +1 麻痺屬性強化 +1
2 精英・朱毒鎧甲β						4 1 0 收刀術 +1
3 精英・朱毒腕甲β						4 0 0 毒屬性強化 +1 迴避性能 +1
4 精英・朱毒腰甲β						4 1 0 體術 +1
5 精英・朱毒護腿β						4 1 0 迴避性能 +1

@resistences 0 -1 -2 3 0
@set 精英・礦石α
1 精英・礦石頭盔α 						2 0 0 冰耐性 +2 耳塞 +2
2 精英・礦石鎧甲α 						2 0 0 耳塞 +2 冰屬性攻擊強化 +1
3 精英・礦石腕甲α 						2 1 0 防禦 +2 冰屬性攻擊強化 +2
4 精英・礦石腰甲α 						2 2 0 砲彈裝填數UP +1 防禦 +2
5 精英・礦石護腿α 						2 2 1 砲擊手 +2 冰耐性 +1
@set 精英・礦石β
1 精英・礦石頭盔β 						4 1 0 冰耐性 +2 耳塞 +1
2 精英・礦石鎧甲β 						4 1 0 耳塞 +1 冰屬性攻擊強化 +1
3 精英・礦石腕甲β 						4 1 0 防禦 +2 冰屬性攻擊強化 +1
4 精英・礦石腰甲β 						4 2 0 砲彈裝填數UP +1 防禦 +1
5 精英・礦石護腿β 						4 3 0 砲擊手 +1 冰耐性 +1

@resistences -2 2 -1 3 -3
@set 精英・猛牛龍α
1 精英・猛牛龍頭盔α 					2 0 0 怨恨 +2 最愛菇類 +1
2 精英・猛牛龍鎧甲α 					3 0 0 快吃 +1 攻擊守勢 +1
3 精英・猛牛龍腕甲α 					2 0 0 攻擊守勢 +1 體力增強 +2
4 精英・猛牛龍腰甲α 					3 0 0 最愛菇類 +1 攻擊守勢 +1
5 精英・猛牛龍護腿α 					3 0 0 最愛菇類 +1 快吃 +1
@set 精英・猛牛龍β
1 精英・猛牛龍頭盔β 					4 1 0 怨恨 +2
2 精英・猛牛龍鎧甲β 					4 1 0 快吃 +1
3 精英・猛牛龍腕甲β 					4 0 0 攻擊守勢 +1 體力增強 +1
4 精英・猛牛龍腰甲β 					4 1 0 最愛菇類 +1
5 精英・猛牛龍護腿β 					4 1 0 最愛菇類 +1

@bonus 蠻顎龍的霸气
@resistences -2 2 -1 3 -3
@set 精英・蠻顎龍α
1 精英・蠻顎龍頭盔α 					3 0 0 火屬性攻擊強化 +2 火耐性 +1
2 精英・蠻顎龍鎧甲α 					1 1 0 跑者 +2 特殊射擊強化 +1
3 精英・蠻顎龍腕甲α 					2 0 0 特殊射擊強化 +1 火屬性攻擊強化 +2
4 精英・蠻顎龍腰甲α 					3 1 0 火耐性 +2 砲術 +1
5 精英・蠻顎龍護腿α 					2 0 0 砲術 +2 跑者 +1
@set 精英・蠻顎龍β
1 精英・蠻顎龍頭盔β 					4 0 0 火屬性攻擊強化 +2
2 精英・蠻顎龍鎧甲β 					4 1 0 跑者 +1 特殊射擊強化 +1
3 精英・蠻顎龍腕甲β 					4 0 0 特殊射擊強化 +1 火屬性攻擊強化 +1
4 精英・蠻顎龍腰甲β 					4 2 0 火耐性 +2
5 精英・蠻顎龍護腿β 					4 1 0 砲術 +2

@rare 11
@bonus 蠻顎龍的霸气
@resistences -1 -1 2 -3 0
@set 精英・雷顎α
1 精英・雷顎頭盔α                     2 1 0 弱點特效 +1 死裡逃生 +1
2 精英・雷顎鎧甲α                     3 0 0 減輕膽怯 +1 昏厥耐性 +2
3 精英・雷顎腕甲α                     2 0 0 道具使用強化 +2 雷屬性攻擊強化 +2
4 精英・雷顎腰甲α                     1 0 0 弱點特效 +2 道具使用強化 +1
5 精英・雷顎護腿α                     2 1 0 雷屬性攻擊強化 +2 特殊射擊強化 +1
@set 精英・雷顎β
1 精英・雷顎頭盔β                     4 2 0 弱點特效 +1
2 精英・雷顎鎧甲β                     4 0 0 減輕膽怯 +1 昏厥耐性 +1
3 精英・雷顎腕甲β                     4 2 0 道具使用強化 +2
4 精英・雷顎腰甲β                     4 1 0 弱點特效 +1 道具使用強化 +1
5 精英・雷顎護腿β                     4 1 0 雷屬性攻擊強化 +2

@rare 9
@bonus 雌火龍的真髓
@resistences 2 0 -2 0 -3
@set 精英・雌火龍α
1 精英・雌火龍頭盔α 					3 0 0 體力增強 +2 毒屬性強化 +1
2 精英・雌火龍鎧甲α 					2 2 0 植生學 +2 體力回復量UP +1
3 精英・雌火龍腕甲α 					3 0 0 毒屬性強化 +2 植生學 +1
4 精英・雌火龍腰甲α 					3 2 0 毒耐性 +2 體力增強 +1
5 精英・雌火龍護腿α 					3 0 0 體力回復量UP +2 毒耐性 +1
@set 精英・雌火龍β
1 精英・雌火龍頭盔β 					4 0 0 體力增強 +1 毒屬性強化 +1
2 精英・雌火龍鎧甲β 					4 2 0 植生學 +1 體力回復量UP +1
3 精英・雌火龍腕甲β 					4 0 0 毒屬性強化 +2
4 精英・雌火龍腰甲β 					4 2 0 毒耐性 +1 體力增強 +1
5 精英・雌火龍護腿β 					4 0 0 體力回復量UP +2

@bonus 雌火龍的真髓
@resistences 3 0 0 -3 -4
@set 精英・火龍心α
1 精英・火龍心頭盔α 					3 0 0 迴避距離UP +2 攀岩者 +1
2 精英・火龍心鎧甲α 					2 0 0 整備 +2 匠 +1
3 精英・火龍心腕甲α 					2 0 0 風壓耐性 +2 匠 +1
4 精英・火龍心腰甲α 					3 0 0 匠 +1 毒耐性 +2
5 精英・火龍心護腿α 					3 1 0 整備 +1 風壓耐性 +1
@set 精英・火龍心β
1 精英・火龍心頭盔β 					4 1 0 迴避距離UP +2
2 精英・火龍心鎧甲β 					4 1 1 整備 +2
3 精英・火龍心腕甲β 					4 2 0 風壓耐性 +2
4 精英・火龍心腰甲β 					4 0 0 匠 +1 毒耐性 +1
5 精英・火龍心護腿β 					4 2 0 整備 +1

@bonus 无
@resistences -3 2 0 1 0
@set 精英・浮空龍α
1 精英・浮空龍頭盔α 					3 0 0 耐力急速回復 +2 風壓耐性 +1
2 精英・浮空龍鎧甲α 					3 1 0 騎乘名人 +1 砲術 +1
3 精英・浮空龍腕甲α 					2 2 0 砲術 +2 風壓耐性 +1
4 精英・浮空龍腰甲α 					2 2 0 精靈加護 +2 風壓耐性 +1
5 精英・浮空龍護腿α 					3 0 0 風壓耐性 +2 耐力急速回復 +1
@set 精英・浮空龍β
1 精英・浮空龍頭盔β 					4 1 0 耐力急速回復 +2
2 精英・浮空龍鎧甲β 					4 1 0 騎乘名人 +1
3 精英・浮空龍腕甲β 					4 1 0 砲術 +1 風壓耐性 +1
4 精英・浮空龍腰甲β 					4 1 0 精靈加護 +1 風壓耐性 +1
5 精英・浮空龍護腿β 					4 1 0 風壓耐性 +2

@bonus 无
@resistences -3 -3 2 1 1
@set 精英・浮夢α
1 精英・浮夢頭盔α 						1 1 0 弱點特效 +1 廣域化 +1
2 精英・浮夢鎧甲α 						2 0 0 廣域化 +2 精神抖擻 +1
3 精英・浮夢腕甲α 						2 0 0 精神抖擻 +1 睡眠屬性強化 +1
4 精英・浮夢腰甲α 						2 0 0 睡眠屬性強化 +2 廣域化 +1
5 精英・浮夢護腿α 						3 0 0 睡眠耐性 +2 廣域化 +1
@set 精英・浮夢β
1 精英・浮夢頭盔β						4 0 0 弱點特效 +1
2 精英・浮夢鎧甲β 						4 1 0 廣域化 +2
3 精英・浮夢腕甲β 						4 0 0 精神抖擻 +1
4 精英・浮夢腰甲β 						4 0 0 睡眠屬性強化 +2
5 精英・浮夢護腿β 						4 1 0 睡眠耐性 +2

@bonus 无
@resistences 0 2 0 -1 -2
@set 精英・骨鎚龍α
1 精英・骨鎚龍頭盔α 					1 1 0 耐震 +2 KO術 +1
2 精英・骨鎚龍鎧甲α 					3 0 0 睡眠屬性強化 +1 裂傷耐性 +1
3 精英・骨鎚龍腕甲α 					2 0 0 睡眠屬性強化 +2 防禦性能 +1
4 精英・骨鎚龍腰甲α 					1 0 0 防禦性能 +2 睡眠耐性 +2
5 精英・骨鎚龍護腿α 					2 0 0 裂傷耐性 +2 防禦性能 +1
@set 精英・骨鎚龍β
1 精英・骨鎚龍頭盔β 					4 0 0 耐震 +2
2 精英・骨鎚龍鎧甲β 					4 0 0 睡眠屬性強化 +1
3 精英・骨鎚龍腕甲β 					4 0 0 睡眠屬性強化 +1 防禦性能 +1
4 精英・骨鎚龍腰甲β 					4 0 0 防禦性能 +2
5 精英・骨鎚龍護腿β 					4 1 0 裂傷耐性 +2

@rare 10
@bonus 太古的神秘
@resistences 1 -2 -2 2 3
@set 精英・機械α
1 精英・機械頭盔α 						2 0 0 投射器裝填數UP +2 屬性解放／裝填擴充 +1
2 精英・機械鎧甲α 						1 0 0 看破 +3 無傷 +1
3 精英・機械腕甲α 						1 1 0 屬性解放／裝填擴充 +2 整備 +1
4 精英・機械腰甲α 						1 1 0 整備 +2 看破 +1
5 精英・機械護腿α 						1 1 0 無傷 +2 投射器裝填數UP +1
@set 精英・機械β
1 精英・機械頭盔β 						4 1 0 投射器裝填數UP +1 屬性解放／裝填擴充 +1
2 精英・機械鎧甲β 						4 0 0 看破 +2 無傷 +1
3 精英・機械腕甲β 						4 0 0 屬性解放／裝填擴充 +2
4 精英・機械腰甲β 						4 1 0 整備 +1 看破 +1
5 精英・機械護腿β 						4 0 0 無傷 +2

@bonus 調查團的煉金術
@resistences 2 2 2 -1 -1
@set 精英・蒸汽貴族α
1 精英・蒸汽貴族頭盔α 					1 1 0 挑戰者 +2 破壞王 +1
2 精英・蒸汽貴族鎧甲α 					1 1 0 挑戰者 +2 特殊射擊強化 +1
3 精英・蒸汽貴族腕甲α 					2 0 0 炸彈客 +3 耐震 +1
4 精英・蒸汽貴族腰甲α 					2 0 0 破壞王 +2 睡眠瓶追加 +1
5 精英・蒸汽貴族護腿α 					1 1 0 超會心 +1 炸彈客 +2
@set 精英・蒸汽貴族β
1 精英・蒸汽貴族頭盔β 					4 1 0 挑戰者 +1 破壞王 +1
2 精英・蒸汽貴族鎧甲β 					4 1 0 挑戰者 +2
3 精英・蒸汽貴族腕甲β 					4 0 0 炸彈客 +3
4 精英・蒸汽貴族腰甲β 					4 1 0 破壞王 +2
5 精英・蒸汽貴族護腿β 					4 0 0 超會心 +1 炸彈客 +1

@bonus 无
@resistences -2 0 3 -1 0
@set 精英・鑄鐵α
1 精英・鑄鐵頭盔α                      2 0 0 雷屬性攻擊強化 +2 風壓耐性 +1
2 精英・鑄鐵鎧甲α                      3 0 0 雷耐性 +2 屬性解放／裝填擴充 +1
#3 精英・鑄鐵腕甲α                      2 1 0 體力增強 +2 雷屬性攻擊強化 +2
4 精英・鑄鐵腰甲α                      2 0 0 風壓耐性 +2 屬性解放／裝填擴充 +1
5 精英・鑄鐵護腿α                      2 0 0 防禦 +2 屬性解放／裝填擴充 +1
@set 精英・鑄鐵β
1 精英・鑄鐵頭盔β                      4 2 0 雷屬性攻擊強化 +2
2 精英・鑄鐵鎧甲β                      4 0 0 雷耐性 +1 屬性解放／裝填擴充 +1
#3 精英・鑄鐵腕甲β                      4 0 0 體力增強 +2 雷屬性攻擊強化 +1
4 精英・鑄鐵腰甲β                      4 1 0 風壓耐性 +1 屬性解放／裝填擴充 +1
5 精英・鑄鐵護腿β                      4 0 0 防禦 +1 屬性解放／裝填擴充 +1

@bonus 无
@resistences -2 0 3 -1 0
@set 精英・冰牙龍α
1 精英・冰牙龍頭盔α                     1 1 0 迴避距離UP +2 強化持續 +1
2 精英・冰牙龍鎧甲α                     3 0 0 強化持續 +1 體術 +1
3 精英・冰牙龍腕甲α                     2 0 0 體力回復量UP +2 體術 +2
4 精英・冰牙龍腰甲α                     3 0 0 收刀術 +1 體力回復量UP +1
5 精英・冰牙龍護腿α                     1 1 0 體術 +2 收刀術 +1
@set 精英・冰牙龍β
1 精英・冰牙龍頭盔β                     4 1 0 迴避距離UP +1 強化持續 +1
2 精英・冰牙龍鎧甲β                     4 1 0 強化持續 +1
3 精英・冰牙龍腕甲β                     4 0 0 體力回復量UP +2 體術 +1
4 精英・冰牙龍腰甲β                     4 0 0 收刀術 +1
5 精英・冰牙龍護腿β                     4 1 0 體術 +1 收刀術 +1

@bonus 火龍的真髓
@resistences 3 1 -2 1 -3
@set 精英・火龍α
1 精英・火龍頭盔α                      2 0 0 攻擊 +2 火屬性攻擊強化 +2
2 精英・火龍鎧甲α                      1 1 0 弱點特效 +2 火屬性攻擊強化 +1
3 精英・火龍腕甲α                      3 0 0 跳躍鐵人 +1 弱點特效 +1
4 精英・火龍腰甲α                      2 0 0 火屬性攻擊強化 +2 集中 +2
5 精英・火龍護腿α                      3 0 0 投射器裝填數UP +2 攻擊 +2
@set 火龍β
1 精英・火龍頭盔β                      4 1 0 攻擊 +2
2 精英・火龍鎧甲β                      4 0 0 弱點特效 +2
3 精英・火龍腕甲β                      4 3 0 跳躍鐵人 +1
4 精英・火龍腰甲β                      4 2 0 火屬性攻擊強化 +2
5 精英・火龍護腿β                      4 0 0 投射器裝填數UP +2 攻擊 +1

@rare 11
@bonus 火龍的真髓
@resistences 3 2 3 -3 -4
@set 精英・火龍魂α
1 精英・火龍魂頭盔α                     1 1 0 超會心 +1 攀岩者 +1
2 精英・火龍魂鎧甲α                     2 0 0 屬性解放／裝填擴充 +1 破壞王 +1
3 精英・火龍魂腕甲α                     2 0 0 破壞王 +2 風壓耐性 +1
4 精英・火龍魂腰甲α                     3 0 0 風壓耐性 +2 貫通彈・龍之箭強化 +1
5 精英・火龍魂護腿α                     1 0 0 超會心 +1 風壓耐性 +2 
@set 精英・火龍魂β
1 精英・火龍魂頭盔β                     4 0 0 超會心 +1
2 精英・火龍魂鎧甲β                     4 1 0 屬性解放／裝填擴充 +1
3 精英・火龍魂腕甲β                     4 1 0 破壞王 +1 風壓耐性 +1
4 精英・火龍魂腰甲β                     4 2 0 風壓耐性 +2
5 精英・火龍魂護腿β                     4 0 0 超會心 +1 風壓耐性 +1

@rare 10
@bonus 角龍的霸氣
@resistences 3 -2 0 -3 2
@set 精英・角龍α
1 精英・角龍頭盔α                      2 0 0 拔刀術【技】 +2 KO術 +1
2 精英・角龍鎧甲α                      2 0 0 KO術 +2 火場怪力 +2
3 精英・角龍腕甲α                      2 0 0 火場怪力 +3 耐震 +1
4 精英・角龍腰甲α                      2 0 0 跑者 +2 拔刀術【技】 +1
5 精英・角龍護腿α                      1 1 0 耐震 +2 KO術 +2
@set 精英・角龍β
1 精英・角龍頭盔β                      4 0 0 拔刀術【技】 +2
2 精英・角龍鎧甲β                      4 1 0 KO術 +2 火場怪力 +1
3 精英・角龍腕甲β                      4 1 0 火場怪力 +2 耐震 +1
4 精英・角龍腰甲β                      4 1 0 跑者 +2
5 精英・角龍護腿β                      4 1 0 耐震 +2 KO術 +1

@rare 11
@bonus 角龍的霸氣
@resistences 2 -3 0 -4 2
@set 精英・暴君角龍α
1 精英・暴君角龍頭盔α                    1 1 0 破壞王 +2 怨恨 +1
2 精英・暴君角龍鎧甲α                    2 0 0 怨恨 +2 跑者 +1
3 精英・暴君角龍腕甲α                    1 1 0 KO術 +2 跑者 +1
4 精英・暴君角龍腰甲α                    2 0 0 KO術 +2 破壞王 +1
5 精英・暴君角龍護腿α                    1 0 0 怨恨 +2 KO術 +1
@set 精英・暴君角龍β
1 精英・暴君角龍頭盔β                    4 1 0 破壞王 +2
2 精英・暴君角龍鎧甲β                    4 1 0 怨恨 +1 跑者 +1
3 精英・暴君角龍腕甲β                    4 2 0 KO術 +1 跑者 +1
4 精英・暴君角龍腰甲β                    4 1 0 KO術 +2
5 精英・暴君角龍護腿β                    4 0 0 怨恨 +2

@rare 10
@bonus 風漂龍的霸氣
@resistences -1 2 -3 3 0
@set 精英・風漂龍α
1 精英・風漂龍頭盔α                     2 0 0 精靈加護 +2 冰屬性攻擊強化 +1
2 精英・風漂龍鎧甲α                     1 0 0 迴避性能 +2 精靈加護 +2
3 精英・風漂龍腕甲α                     3 0 0 飛燕 +1 迴避性能 +2
4 精英・風漂龍腰甲α                     2 0 0 冰屬性攻擊強化 +2 風壓耐性 +2
5 精英・風漂龍護腿α                     3 0 0 冰耐性 +2 拔刀術【技】 +1
@set 精英・風漂龍β
1 精英・風漂龍頭盔β                     4 1 0 精靈加護 +2
2 精英・風漂龍鎧甲β                     4 0 0 迴避性能 +2 精靈加護 +1
3 精英・風漂龍腕甲β                     4 2 0 飛燕 +1 迴避性能 +1
4 精英・風漂龍腰甲β                     4 1 0 冰屬性攻擊強化 +2 風壓耐性 +1
5 精英・風漂龍護腿β                     4 2 0 冰耐性 +2

@rare 11
@bonus 風漂龍的霸氣
@resistences -3 2 -1 3 0
@set 精英・霜漂α
1 精英・霜漂頭盔α                      1 1 1 飢餓耐性 +2 迴避距離UP +1
2 精英・霜漂鎧甲α                      1 1 0 集中 +2 跑者 +1
3 精英・霜漂腕甲α                      1 1 0 拔刀術【技】 +2 飢餓耐性 +1
4 精英・霜漂腰甲α                      1 1 0 迴避距離UP +2 集中 +1
5 精英・霜漂護腿α                      1 1 0 跑者 +2 散彈・剛射強化 +1
@set 精英・霜漂β
1 精英・霜漂頭盔β                      4 1 0 飢餓耐性 +2 迴避距離UP +1
2 精英・霜漂鎧甲β                      4 0 0 集中 +2 跑者 +1
3 精英・霜漂腕甲β                      4 0 0 拔刀術【技】 +2 飢餓耐性 +1
4 精英・霜漂腰甲β                      4 0 0 迴避距離UP +2 集中 +1
5 精英・霜漂護腿β                      4 2 0 跑者 +2 散彈・剛射強化 +1

@rare 10
@bonus 慘爪龍的真髓
@resistences 2 2 -2 -3 0
@set 精英・慘爪龍α
1 精英・慘爪龍頭盔α                     2 0 0 裂傷耐性 +2 看破 +2
2 精英・慘爪龍鎧甲α                     3 0 0 砥石使用高速化 +2 裂傷耐性 +1
3 精英・慘爪龍腕甲α                     1 0 0 體術 +2 看破 +1
4 精英・慘爪龍腰甲α                     2 0 0 看破 +3 砥石使用高速化 +1
5 精英・慘爪龍護腿α                     1 0 0 收刀術 +2 看破 +1
@set 精英・慘爪龍β
1 精英・慘爪龍頭盔β                     4 0 0 裂傷耐性 +2 看破 +1
2 精英・慘爪龍鎧甲β                     4 1 0 砥石使用高速化 +2
3 精英・慘爪龍腕甲β                     4 0 0 體術 +1 看破 +1
4 精英・慘爪龍腰甲β                     4 2 0 看破 +2
5 精英・慘爪龍護腿β                     4 0 0 收刀術 +1 看破 +1

@rare 11
@bonus 慘爪龍的真髓
@resistences -2 -3 -2 -2 4
@set 精英・亡爪龍α
1 精英・亡爪龍頭盔α                     3 0 0 力量解放 +2 整備 +1
2 精英・亡爪龍鎧甲α                     2 0 0 看破 +3 龍耐性 +2
3 精英・亡爪龍腕甲α                     2 1 0 強化持續 +1 龍屬性攻擊強化 +2
4 精英・亡爪龍腰甲α                     2 1 0 龍屬性攻擊強化 +2 力量解放 +1
5 精英・亡爪龍護腿α                     1 1 0 整備 +2 強化持續 +1
@set 精英・亡爪龍β
1 精英・亡爪龍頭盔β                     4 2 0 力量解放 +2
2 精英・亡爪龍鎧甲β                     4 1 0 看破 +2 龍耐性 +1
3 精英・亡爪龍腕甲β                     4 1 0 強化持續 +1 龍屬性攻擊強化 +1
4 精英・亡爪龍腰甲β                     4 2 0 龍屬性攻擊強化 +2
5 精英・亡爪龍護腿β                     4 1 1 整備 +2

@rare 10
@bonus 无
@resistences 3 -3 1 -2 2
@set 精英・熔岩龍α
1 精英・熔岩龍頭盔α                     1 1 0 火屬性攻擊強化 +2 收刀術 +1
2 精英・熔岩龍鎧甲α                     1 1 0 火屬性攻擊強化 +3 熱傷害無效 +1
3 精英・熔岩龍腕甲α                     1 0 0 無傷 +2 體力回復量UP +1
4 精英・熔岩龍腰甲α                     1 0 0 收刀術 +2 體力回復量UP +2
5 精英・熔岩龍護腿α                     2 0 0 散彈・剛射強化 +1 火屬性攻擊強化 +2
@set 精英・熔岩龍β
1 精英・熔岩龍頭盔β                     4 1 0 火屬性攻擊強化 +1 收刀術 +1
2 精英・熔岩龍鎧甲β                     4 1 0 火屬性攻擊強化 +2 熱傷害無效 +1
3 精英・熔岩龍腕甲β                     4 0 0 無傷 +1 體力回復量UP +1
4 精英・熔岩龍腰甲β                     4 0 0 收刀術 +2 體力回復量UP +1
5 精英・熔岩龍護腿β                     4 1 0 散彈・剛射強化 +1 火屬性攻擊強化 +1

@bonus 爆鎚龍的霸氣
@resistences 4 -3 1 -2 -2
@set 精英・爆鎚龍α
1 精英・爆鎚龍頭盔α                     2 1 0 爆破異常狀態的耐性 +2 減輕膽怯 +1
2 精英・爆鎚龍鎧甲α                     3 0 0 破壞王 +2 爆破異常狀態的耐性 +1
3 精英・爆鎚龍腕甲α                     2 0 0 防禦性能 +2 防御力DOWN耐性 +2
4 精英・爆鎚龍腰甲α                     2 1 0 破壞王 +1 防禦性能 +1
5 精英・爆鎚龍護腿α                     1 0 0 防禦性能 +2 攻擊守勢 +1
@set 精英・爆鎚龍β
1 精英・爆鎚龍頭盔β                     4 3 0 爆破異常狀態的耐性 +2
2 精英・爆鎚龍鎧甲β                     4 0 0 破壞王 +2
3 精英・爆鎚龍腕甲β                     4 0 0 防禦性能 +2 防御力DOWN耐性 +1
4 精英・爆鎚龍腰甲β                     4 2 0 破壞王 +1
5 精英・爆鎚龍護腿β                     4 1 0 防禦性能 +2

@bonus 迅龍的真髓
@resistences -2 2 -3 0 0
@set 精英・迅龍α
1 精英・迅龍頭盔α                      1 1 0 無傷 +2 貫通彈・龍之箭強化 +1
2 精英・迅龍鎧甲α                      2 0 0 迴避性能 +2 蹲下移動速度UP +1
3 精英・迅龍腕甲α                      1 0 0 耐力急速回復 +2 潛伏 +2
4 精英・迅龍腰甲α                      1 0 0 迴避性能 +2 耐力急速回復 +1
5 精英・迅龍護腿α                      1 1 0 迴避性能 +1 無傷 +1
@set 精英・迅龍β
1 精英・迅龍頭盔β                      4 1 0 無傷 +1 貫通彈・龍之箭強化 +1
2 精英・迅龍鎧甲β                      4 0 0 迴避性能 +2
3 精英・迅龍腕甲β                      4 0 0 耐力急速回復 +2
4 精英・迅龍腰甲β                      4 0 0 迴避性能 +1 耐力急速回復 +1
5 精英・迅龍護腿β                      4 1 0 迴避性能 +1

@bonus 斬龍的真髓
@resistences 3 -3 1 -1 -1
@set 精英・斬龍α
1 精英・斬龍頭盔α                      1 0 0 集中 +2 匠 +1
2 精英・斬龍鎧甲α                      1 0 0 強化持續 +2 精神抖擻 +1
3 精英・斬龍腕甲α                      1 0 0 精神抖擻 +2 集中 +1
4 精英・斬龍腰甲α                      1 1 0 精神抖擻 +2 通常彈・通常箭強化 +1
5 精英・斬龍護腿α                      2 0 0 匠 +2 熱傷害無效 +1
@set 精英・斬龍β
1 精英・斬龍頭盔β                      4 0 0 集中 +1 匠 +1
2 精英・斬龍鎧甲β                      4 0 0 強化持續 +1 精神抖擻 +1
3 精英・斬龍腕甲β                      4 0 0 精神抖擻 +1 集中 +1
4 精英・斬龍腰甲β                      4 0 0 精神抖擻 +2
5 精英・斬龍護腿β                      4 0 0 匠 +2

@rare 11
@bonus 斬龍的真髓
@resistences -3 2 -1 2 -1
@set 精英・斬黃α
1 精英・斬黃頭盔α                      1 0 0 精神抖擻 +2 瘴氣耐性 +2
2 精英・斬黃鎧甲α                      1 0 0 匠 +2 耐力急速回復 +1
3 精英・斬黃腕甲α                      2 1 0 昏厥耐性 +2 匠 +1
4 精英・斬黃腰甲α                      2 0 0 匠 +2 防御力DOWN耐性 +2
5 精英・斬黃護腿α                      1 0 0 精神抖擻 +2 耐力急速回復 +1
@set 精英・斬黃β
1 精英・斬黃頭盔β                      4 0 0 精神抖擻 +1 瘴氣耐性 +2
2 精英・斬黃鎧甲β                      4 1 0 匠 +1 耐力急速回復 +1
3 精英・斬黃腕甲β                      4 2 1 昏厥耐性 +2
4 精英・斬黃腰甲β                      4 0 0 匠 +2
5 精英・斬黃護腿β                      4 2 0 精神抖擻 +1

@rare 10
@bonus 碎龍的真髓
@resistences 3 -2 1 -3 1
@set 精英・碎龍α
1 精英・碎龍頭盔α                      3 0 0 挑戰者 +2 砲彈裝填數UP +1
2 精英・碎龍鎧甲α                      1 0 0 奪取耐力 +2 挑戰者 +1
3 精英・碎龍腕甲α                      2 0 0 挑戰者 +2 爆破異常狀態的耐性 +2
4 精英・碎龍腰甲α                      3 0 0 爆破屬性強化 +2 奪取耐力 +1
5 精英・碎龍護腿α                      2 0 0 挑戰者 +2 砲術 +2
@set 精英・碎龍β
1 精英・碎龍頭盔β                      4 1 0 挑戰者 +2
2 精英・碎龍鎧甲β                      4 0 0 奪取耐力 +1 挑戰者 +1
3 精英・碎龍腕甲β                      4 0 0 挑戰者 +2 爆破異常狀態的耐性 +1
4 精英・碎龍腰甲β                      4 2 0 爆破屬性強化 +2
5 精英・碎龍護腿β                      4 0 0 挑戰者 +2 砲術 +1

@bonus 轟龍的真髓
@resistences 2 0 -3 0 -2
@set 精英・轟龍α
1 精英・轟龍頭盔α                      1 0 0 攻擊 +2 耳塞 +2
2 精英・轟龍鎧甲α                      2 0 0 耳塞 +2 滿足感 +1
3 精英・轟龍腕甲α                      1 0 0 快吃 +2 攻擊 +2
4 精英・轟龍腰甲α                      3 1 0 耳塞 +1 滿足感 +1
5 精英・轟龍護腿α                      3 1 0 快吃 +1 滿足感 +1
@set 精英・轟龍β
1 精英・轟龍頭盔β                      4 0 0 攻擊 +2 耳塞 +1
2 精英・轟龍鎧甲β                      4 1 0 耳塞 +2
3 精英・轟龍腕甲β                      4 0 0 快吃 +2 攻擊 +1
4 精英・轟龍腰甲β                      4 2 1 耳塞 +1
5 精英・轟龍護腿β                      4 2 0 快吃 +1

@rare 11
@bonus 教官的引導
@resistences 1 1 1 1 2
@set 精英・鬥技場獎賞1α
1 精英・黑帶頭盔α                      3 0 0 跑者 +2 最愛菇類 +1
2 精英・黑帶鎧甲α                      1 1 1 最愛菇類 +2 廣域化 +1
3 精英・黑帶腕甲α                      3 0 0 廣域化 +2 吹笛名人 +2
4 精英・黑帶腰甲α                      3 0 0 體力回復量UP +2 跑者 +1
5 精英・黑帶護腿α                      2 2 0 廣域化 +2 體力回復量UP +1
@set 精英・鬥技場獎賞1β
1 精英・黑帶頭盔β                      4 2 0 跑者 +2
2 精英・黑帶鎧甲β                      4 1 1 最愛菇類 +2
3 精英・黑帶腕甲β                      4 1 0 廣域化 +2
4 精英・黑帶腰甲β                      4 1 0 體力回復量UP +2
5 精英・黑帶護腿β                      4 2 0 廣域化 +2

@bonus 无
@resistences -2 0 -1 -1 4
@set 精英・杜賓α
1 精英・杜賓頭盔α                      1 0 0 屬性解放／裝填擴充 +2 耐力急速回復 +1
2 精英・杜賓鎧甲α                      1 1 1 攻擊 +2 瘴氣耐性 +1
3 精英・杜賓腕甲α                      2 1 0 耐力急速回復 +2 最愛菇類 +1
4 精英・杜賓腰甲α                      2 1 0 攻擊 +2 昏厥耐性 +2
5 精英・杜賓護腿α                      2 0 0 攻擊 +2 最愛菇類 +2
@set 精英・杜賓β
1 精英・杜賓頭盔β                      4 0 0 屬性解放／裝填擴充 +2
2 精英・杜賓鎧甲β                      4 1 1 攻擊 +1 瘴氣耐性 +1
3 精英・杜賓腕甲β                      4 1 0 耐力急速回復 +1 最愛菇類 +1
4 精英・杜賓腰甲β                      4 2 0 攻擊 +1 昏厥耐性 +2
5 精英・杜賓護腿β                      4 2 0 攻擊 +1 最愛菇類 +2

@resistences 3 1 -2 -4 -2
@set 精英・矜持α
1 精英・矜持頭盔α                      2 1 0 耳塞 +2 爆破屬性強化 +2
2 精英・矜持鎧甲α                      1 1 0 防禦性能 +2 爆破異常狀態的耐性 +2
3 精英・矜持腕甲α                      3 0 0 拔刀術【技】 +2 耳塞 +1
4 精英・矜持腰甲α                      3 0 0 炸彈客 +2 拔刀術【技】 +1
5 精英・矜持護腿α                      3 0 0 耳塞 +2 跳躍鐵人 +1
@set 精英・矜持β
1 精英・矜持頭盔β                      4 1 0 耳塞 +2 爆破屬性強化 +1
2 精英・矜持鎧甲β                      4 1 1 防禦性能 +2
3 精英・矜持腕甲β                      4 3 0 拔刀術【技】 +2
4 精英・矜持腰甲β                      4 2 0 炸彈客 +2
5 精英・矜持護腿β                      4 2 0 耳塞 +1 跳躍鐵人 +1

@bonus 恐暴龍的真髓
@resistences 2 1 -3 1 -3
@set 精英・貪欲α
1 精英・貪欲頭盔α                      1 0 0 破壞王 +1 匠 +2
2 精英・貪欲鎧甲α                      2 0 0 快吃 +1 匠 +2
3 精英・貪欲腕甲α                      2 0 0 奪取耐力 +2 破壞王 +1
4 精英・貪欲腰甲α                      1 0 0 奪取耐力 +2 匠 +1
5 精英・貪欲護腿α                      2 2 0 快吃 +2 奪取耐力 +1
@set 精英・貪欲β
1 精英・貪欲頭盔β                      4 3 0 破壞王 +1
2 精英・貪欲鎧甲β                      4 2 2 快吃 +1
3 精英・貪欲腕甲β                      4 0 0 奪取耐力 +2
4 精英・貪欲腰甲β                      4 1 0 奪取耐力 +2
5 精英・貪欲護腿β                      4 2 0 快吃 +1 奪取耐力 +1

@rare 12
@bonus 冰呪龍的神秘
@resistences -3 2 -1 4 -1
@set 精英・雪崩α
1 精英・雪崩頭盔α                      3 2 0 精靈加護 +2 轉禍為福 +1
2 精英・雪崩鎧甲α                      1 0 0 收刀術 +2 拔刀術【技】 +1
3 精英・雪崩腕甲α                      1 0 0 收刀術 +1 減輕膽怯 +2
4 精英・雪崩腰甲α                      2 1 0 減輕膽怯 +1 轉禍為福 +1
5 精英・雪崩護腿α                      1 1 0 拔刀術【技】 +2 轉禍為福 +1
@set 精英・雪崩β
1 精英・雪崩頭盔β                      4 2 0 精靈加護 +2
2 精英・雪崩鎧甲β                      4 1 0 收刀術 +2
3 精英・雪崩腕甲β                      4 0 0 收刀術 +1 減輕膽怯 +1
4 精英・雪崩腰甲β                      4 1 0 減輕膽怯 +1
5 精英・雪崩護腿β                      4 1 0 拔刀術【技】 +2

@bonus 屍套龍之命脈
@resistences -2 4 1 1 -3
@set 精英・死滅α
1 精英・死滅頭盔α                      1 0 0 無傷 +2 龍屬性攻擊強化 +2
2 精英・死滅鎧甲α                      3 1 0 回復速度 +2 龍屬性攻擊強化 +2
3 精英・死滅腕甲α                      2 1 1 體力回復量UP +2 快吃 +1
4 精英・死滅腰甲α                      2 1 0 快吃 +2 無傷 +1
5 精英・死滅護腿α                      3 2 0 瘴氣耐性 +2 龍屬性攻擊強化 +2
@set 精英・死滅β
1 精英・死滅頭盔β                      4 1 0 無傷 +2
2 精英・死滅鎧甲β                      4 2 0 回復速度 +2 龍屬性攻擊強化 +1
3 精英・死滅腕甲β                      4 1 1 體力回復量UP +2
4 精英・死滅腰甲β                      4 2 0 快吃 +2
5 精英・死滅護腿β                      4 3 0 瘴氣耐性 +2

@bonus 炎王龍之武技
@resistences 3 -3 1 -3 1
@set 精英・帝王α
1 精英・帝王皇冠α                      1 0 0 力量解放 +2 看破 +2
2 精英・帝王鎧甲α                      2 1 0 力量解放 +1 特殊射擊強化 +2
3 精英・帝王腕甲α                      2 0 0 弱點特效 +2 熱傷害無效 +1
4 精英・帝王腰甲α                      3 0 0 爆破屬性強化 +2 弱點特效 +1
5 精英・帝王護腿α                      2 0 0 力量解放 +2 爆破屬性強化 +2
@set 精英・帝王β
1 精英・帝王皇冠β                      4 0 0 力量解放 +1 看破 +2
2 精英・帝王鎧甲β                      4 1 1 力量解放 +1
3 精英・帝王腕甲β                      4 3 0 弱點特效 +1 熱傷害無效 +1
4 精英・帝王腰甲β                      4 2 1 爆破屬性強化 +2
5 精英・帝王護腿β                      4 0 0 力量解放 +2 爆破屬性強化 +1

@bonus 鋼龍之飛翔
@resistences 0 2 -3 4 -2
@set 精英・鋼龍α
1 精英・鋼龍強力α                      2 0 0 冰屬性攻擊強化 +2 迴避性能 +2
2 精英・鋼龍恐懼α                      1 0 0 匠 +3
3 精英・鋼龍剛強α                      1 0 0 迴避性能 +3
4 精英・鋼龍安穩α                      2 0 0 冰屬性攻擊強化 +3 迴避距離UP +1
5 精英・鋼龍踏實α                      1 0 0 迴避距離UP +2 匠 +2
@set 精英・鋼龍β
1 精英・鋼龍強力β                      4 1 0 冰屬性攻擊強化 +2 迴避性能 +1
2 精英・鋼龍恐懼β                      4 2 0 匠 +2
3 精英・鋼龍剛強β                      4 2 0 迴避性能 +2
4 精英・鋼龍安穩β                      4 1 0 冰屬性攻擊強化 +3
5 精英・鋼龍踏實β                      4 3 0 迴避距離UP +2

@bonus 幻獸的神秘
@resistences -3 -2 4 -2 2
@set 精英・麒麟α
1 精英・麒麟角α                       3 1 0 跑者 +2 精靈加護 +2
2 精英・麒麟服飾α                      3 2 0 看破 +3 精靈加護 +1
3 精英・麒麟長腕甲α                     3 2 0 雷屬性攻擊強化 +3 跑者 +1
4 精英・麒麟腰環α                      2 0 0 屬性異常狀態耐性 +2 屬性解放／裝填擴充 +1
5 精英・麒麟護脛α                      1 0 0 屬性解放／裝填擴充 +2 看破 +2
@set 精英・麒麟β
1 精英・麒麟角β                       4 1 1 跑者 +2 精靈加護 +2
2 精英・麒麟服飾β                      4 2 0 看破 +2 精靈加護 +1
3 精英・麒麟長腕甲β                     4 2 2 雷屬性攻擊強化 +3 跑者 +1
4 精英・麒麟腰環β                      4 1 1 屬性異常狀態耐性 +2 屬性解放／裝填擴充 +1
5 精英・麒麟護脛β                      4 0 0 屬性解放／裝填擴充 +2 看破 +2

@bonus 溟波龍的神秘
@resistences -3 4 3 0 -2
@set 精英・觸角α
1 精英・觸角頭盔α                      1 0 0 體術 +3 精神抖擻 +1
2 精英・觸角鎧甲α                      2 2 0 屬性異常狀態耐性 +2 整備 +1
3 精英・觸角腕甲α                      1 0 0 整備 +2 精神抖擻 +1
4 精英・觸角腰甲α                      1 1 1 體術 +2 耐力急速回復 +1
5 精英・觸角護腿α                      2 1 0 耐力急速回復 +2 屬性異常狀態耐性 +1
@set 精英・觸角β
1 精英・觸角頭盔β                      4 0 0 體術 +2 精神抖擻 +1
2 精英・觸角鎧甲β                      4 2 0 屬性異常狀態耐性 +1 整備 +1
3 精英・觸角腕甲β                      4 0 0 整備 +2
4 精英・觸角腰甲β                      4 1 1 體術 +1 耐力急速回復 +1
5 精英・觸角護腿β                      4 2 0 耐力急速回復 +2

@bonus 天地煌啼龍的神秘
@resistences 0 -2 3 -3 0
@set 精英・迦樓羅α
1 精英・迦樓羅頭盔α                     3 1 0 體力回復量UP +2 破壞王 +1
2 精英・迦樓羅鎧甲α                     3 2 0 轉禍為福 +2 體力增強 +1
3 精英・迦樓羅腕甲α                     1 0 0 超會心 +2 轉禍為福 +1
4 精英・迦樓羅腰甲α                     3 2 0 體力增強 +2 體力回復量UP +1
5 精英・迦樓羅護腿α                     1 1 1 破壞王 +2 防禦 +2
@set 精英・迦樓羅β
1 精英・迦樓羅頭盔β                     4 2 0 體力回復量UP +2
2 精英・迦樓羅鎧甲β                     4 2 0 轉禍為福 +2
3 精英・迦樓羅腕甲β                     4 0 0 超會心 +2
4 精英・迦樓羅腰甲β                     4 3 0 體力增強 +2
5 精英・迦樓羅護腿β                     4 2 1 破壞王 +1 防禦 +1

@bonus 熔山龍的真髓
@resistences 4 -3 -1 -2 -3
@set 精英・鑄島熔岩α
1 精英・鑄島熔岩頭飾α                    2 2 0 減輕膽怯 +1 砲術 +2
2 精英・鑄島熔岩皮α                     3 1 0 耐震 +2 砲術 +2
3 精英・鑄島熔岩鋼爪α                    1 1 0 減輕膽怯 +2 滿足感 +1
4 精英・鑄島熔岩脊椎α                    3 2 0 耐震 +1 砲術 +1
5 精英・鑄島熔岩靴α                     3 1 0 耳塞 +1 匠 +1
@set 精英・鑄島熔岩β
1 精英・鑄島熔岩頭飾β                    4 2 1 減輕膽怯 +1
2 精英・鑄島熔岩皮β                     4 2 0 耐震 +2
3 精英・鑄島熔岩鋼爪β                    4 1 0 減輕膽怯 +2
4 精英・鑄島熔岩脊椎β                    4 3 0 耐震 +1
5 精英・鑄島熔岩靴β                     4 3 0 耳塞 +1

@rare 11
@bonus 无
@resistences 2 -3 2 -2 -2
@set 精英・黑狼鳥α
1 精英・黑狼鳥頭盔α                     3 0 0 看破 +2 怨恨 +1
2 精英・黑狼鳥鎧甲α                     1 0 0 耳塞 +2 看破 +2
3 精英・黑狼鳥腕甲α                     1 0 0 耳塞 +3
4 精英・黑狼鳥腰甲α                     1 1 0 怨恨 +2 毒屬性強化 +2
5 精英・黑狼鳥護腿α                     3 3 0 看破 +2 貫通彈・龍之箭強化 +1
@set 精英・黑狼鳥β
1 精英・黑狼鳥頭盔β                     4 2 0 看破 +1 怨恨 +1
2 精英・黑狼鳥鎧甲β                     4 0 0 耳塞 +1 看破 +2
3 精英・黑狼鳥腕甲β                     4 0 0 耳塞 +2
4 精英・黑狼鳥腰甲β                     4 3 0 怨恨 +2
5 精英・黑狼鳥護腿β                     4 2 2 看破 +2

@bonus 雷狼龍的真髓
@resistences -1 -1 4 -4 1
@set 精英・雷狼龍α
1 精英・雷狼龍頭盔α                     1 0 0 強化持續 +2 超會心 +1
2 精英・雷狼龍鎧甲α                     3 0 0 力量解放 +3 通常彈・通常箭強化 +1
3 精英・雷狼龍腕甲α                     2 1 0 回復速度 +2 力量解放 +2
4 精英・雷狼龍腰甲α                     2 0 0 強化持續 +1 雷屬性攻擊強化 +2
5 精英・雷狼龍護腿α                     1 0 0 雷屬性攻擊強化 +3 力量解放 +2
@set 精英・雷狼龍β
1 精英・雷狼龍頭盔β                     4 0 0 強化持續 +1 超會心 +1
2 精英・雷狼龍鎧甲β                     4 0 0 力量解放 +3
3 精英・雷狼龍腕甲β                     4 2 0 回復速度 +1 力量解放 +2
4 精英・雷狼龍腰甲β                     4 2 0 強化持續 +1
5 精英・雷狼龍護腿β                     4 1 0 雷屬性攻擊強化 +1 力量解放 +2

@rare 12
@bonus 金火龍的真髓
@resistences 3 -2 -4 0 4
@set 精英・金黃澄月α
1 精英・金黃澄月頭盔α                    2 2 0 體力增強 +2 毒屬性強化 +2
2 精英・金黃澄月鎧甲α                    3 1 0 精靈加護 +2 怨恨 +1
3 精英・金黃澄月腕甲α                    2 0 0 怨恨 +2 毒屬性強化 +2
4 精英・金黃澄月腰甲α                    2 2 0 精靈加護 +3 體力增強 +1
5 精英・金黃澄月護腿α                    1 0 0 弱點特效 +2 散彈・剛射強化 +1
@set 精英・金黃澄月β
1 精英・金黃澄月頭盔β                    4 2 0 體力增強 +2
2 精英・金黃澄月鎧甲β                    4 2 1 精靈加護 +2
3 精英・金黃澄月腕甲β                    4 2 0 怨恨 +2
4 精英・金黃澄月腰甲β                    4 2 0 精靈加護 +3
5 精英・金黃澄月護腿β                    4 0 0 弱點特效 +2

@bonus 銀火龍的真髓
@resistences 4 -3 -2 -2 3
@set 精英・銀白耀日α
1 精英・銀白耀日頭盔α                    2 2 0 風壓耐性 +2 火屬性攻擊強化 +2
2 精英・銀白耀日鎧甲α                    1 0 0 超會心 +2 火屬性攻擊強化 +2
3 精英・銀白耀日腕甲α                    2 2 0 投射器裝填數UP +3 風壓耐性 +1
4 精英・銀白耀日腰甲α                    2 0 0 風壓耐性 +2 超會心 +1
5 精英・銀白耀日護腿α                    3 2 0 投射器裝填數UP +2 火屬性攻擊強化 +2
@set 精英・銀白耀日β
1 精英・銀白耀日頭盔β                    4 3 0 風壓耐性 +2
2 精英・銀白耀日鎧甲β                    4 0 0 超會心 +2
3 精英・銀白耀日腕甲β                    4 2 0 投射器裝填數UP +3
4 精英・銀白耀日腰甲β                    4 1 0 風壓耐性 +1 超會心 +1
5 精英・銀白耀日護腿β                    4 2 1 投射器裝填數UP +2

@bonus 炎妃龍的真髓
@resistences 3 1 1 -3 -2
@set 精英・皇后α
1 精英・皇后琴弦α                      3 0 0 整備 +2 攻擊守勢 +2
2 精英・皇后鎧甲α                      2 0 0 無傷 +2 廣域化 +2
3 精英・皇后腕甲α                      2 1 0 整備 +2 爆破屬性強化 +2
4 精英・皇后腰甲α                      2 2 0 體力增強 +2 爆破屬性強化 +2
5 精英・皇后護腿α                      3 1 0 廣域化 +3 整備 +1
@set 精英・皇后β
1 精英・皇后琴弦β                      4 2 0 整備 +2
2 精英・皇后鎧甲β                      4 1 0 無傷 +1 廣域化 +2
3 精英・皇后腕甲β                      4 1 0 整備 +2 爆破屬性強化 +1
4 精英・皇后腰甲β                      4 2 0 體力增強 +2
5 精英・皇后護腿β                      4 2 0 廣域化 +2 整備 +1

@bonus 滅盡龍的霸气
@resistences 1 1 -3 1 -3
@set 精英・狂紋α
1 精英・狂紋頭盔α                      3 1 0 精神抖擻 +2 耐力急速回復 +1
2 精英・狂紋鎧甲α                      2 2 0 耐力急速回復 +2 精神抖擻 +1
3 精英・狂紋腕甲α                      3 0 0 挑戰者 +2 攻擊 +2
4 精英・狂紋腰甲α                      2 1 0 攻擊 +3 耳塞 +1
5 精英・狂紋護腿α                      2 0 0 耳塞 +2 挑戰者 +1
@set 精英・狂紋β
1 精英・狂紋頭盔β                      4 2 0 精神抖擻 +2
2 精英・狂紋鎧甲β                      4 2 0 耐力急速回復 +2
3 精英・狂紋腕甲β                      4 1 0 挑戰者 +2 攻擊 +1
4 精英・狂紋腰甲β                      4 1 0 攻擊 +2 耳塞 +1
5 精英・狂紋護腿β                      4 1 0 耳塞 +2

@bonus 公會的見識
@resistences 2 1 1 2 1
@set 精英・公會成果α
1 精英・公會成果頭盔α                     3 2 0 植生學 +3 蜂蜜獵人 +1
2 精英・公會成果鎧甲α                     3 1 1 攀岩者 +1 減輕膽怯 +1
3 精英・公會成果腕甲α                     3 2 0 地質學 +2 植生學 +1
4 精英・公會成果腰甲α                     3 2 0 探索者之幸運 +1 察覺 +1
5 精英・公會成果護腿α                     2 1 0 減輕膽怯 +2 地質學 +1
@set 精英・公會成果β
1 精英・公會成果頭盔β                     4 3 0 植生學 +2 蜂蜜獵人 +1
2 精英・公會成果鎧甲β                     4 2 2 攀岩者 +1
3 精英・公會成果腕甲β                     4 3 0 地質學 +1 植生學 +1
4 精英・公會成果腰甲β                     4 3 0 探索者之幸運 +1
5 精英・公會成果護腿β                     4 1 0 減輕膽怯 +2

@rare 11
@bonus 金獅子的怒氣
@resistences 2 0 3 -5 2
@set 精英・金色α
1 精英・金色毛髮α                      0 0 0 弱點特效 +2 匠 +2
2 精英・金色羽織α                      3 1 0 怨恨 +2 砥石使用高速化 +2
3 精英・金色臂甲α                      2 0 0 怨恨 +1 匠 +2
4 精英・金色帶α                       3 1 0 弱點特效 +1 匠 +1
5 精英・金色下裳α                      2 2 0 怨恨 +2 攻擊 +2
@set 精英・金色β
1 精英・金色毛髮β                      4 1 0 弱點特效 +2
2 精英・金色羽織β                      4 1 1 怨恨 +2
3 精英・金色臂甲β                      4 3 0 怨恨 +1
4 精英・金色帶β                       4 3 0 弱點特效 +1
5 精英・金色下裳β                      4 2 0 怨恨 +2 攻擊 +1

@bonus 雷狼龍的真髓
@resistences 2 -4 -5 0 4
@set 精英・獄狼龍α
1 精英・獄狼龍頭盔α                     2 1 0 力量解放 +3 耐震 +2
2 精英・獄狼龍鎧甲α                     2 0 0 風壓耐性 +3 減輕膽怯 +2
3 精英・獄狼龍腕甲α                     2 0 0 破壞王 +2 龍屬性攻擊強化 +3
4 精英・獄狼龍腰甲α                     1 1 1 力量解放 +3 耳塞 +2
5 精英・獄狼龍護腿α                     1 1 0 集中 +2 龍封力強化 +1
@set 精英・獄狼龍β
1 精英・獄狼龍頭盔β                     4 1 0 力量解放 +3 耐震 +1
2 精英・獄狼龍鎧甲β                     4 0 0 風壓耐性 +3 減輕膽怯 +1
3 精英・獄狼龍腕甲β                     4 3 0 破壞王 +2
4 精英・獄狼龍腰甲β                     4 1 1 力量解放 +3 耳塞 +1
5 精英・獄狼龍護腿β                     4 1 0 集中 +2

@rare 12
@bonus 冥赤龍的封印
@resistences 2 1 1 1 -1
@set 精英・龍紋α
1 精英・龍紋頭盔α                      2 1 1 迴避性能 +2 超會心 +1
2 精英・龍紋鎧甲α                      3 2 0 屬性異常狀態耐性 +2 超會心 +1
3 精英・龍紋腕甲α                      2 2 2 屬性異常狀態耐性 +1 精神抖擻 +1
4 精英・龍紋腰甲α                      3 0 0 迴避性能 +2 精神抖擻 +1
5 精英・龍紋護腿α                      3 2 1 超會心 +1 精神抖擻 +1
@set 精英・龍紋β
1 精英・龍紋頭盔β                      4 1 1 迴避性能 +1 超會心 +1
2 精英・龍紋鎧甲β                      4 2 0 屬性異常狀態耐性 +1 超會心 +1
3 精英・龍紋腕甲β                      4 2 2 屬性異常狀態耐性 +1
4 精英・龍紋腰甲β                      4 1 0 迴避性能 +2
5 精英・龍紋護腿β                      4 2 1 超會心 +1

@rare 9
@bonus 萬福的祝福
@resistences 1 1 1 4 1
@set 精英・風火輪α
1 精英・風火輪頭部α                     4 0 0 看破 +3
2 精英・風火輪身體α                     4 0 0 耐力急速回復 +2
3 精英・風火輪腕甲α                     4 0 0 轉禍為福 +2
4 精英・風火輪腰部α                     1 1 0 體術 +3
5 精英・風火輪靴α                      4 2 0 體力增強 +2

@rare 11
@bonus 无
@resistences 2 -1 0 -1 -3
@set 精英・健美α
2 精英・健美身體α                     1 1 1 挑戰者 +3 不屈 +1
3 精英・健美腕甲α                     4 0 0 攻擊 +3 死裡逃生 +1
4 精英・健美腰部α                     4 0 0 挑戰者 +2 火場怪力 +3
5 精英・健美護腿α                     4 0 0 攻擊 +3 火場怪力 +2

@rare 9
@bonus 无
@set 无
@resistences 0 0 0 5 0
1 精英・溫泉銀猴α 						2 1 0 體力回復量UP +2

@resistences -1 3 0 4 0
1 精英・企鹅頭套α                      4 0 0 迴避性能 +2

@rare 12
@resistences -3 0 0 1 5
1 精英・封印的龍骸布α                    4 4 0 怨恨 +2
`

	// const rawData = rawDataStart + rawDataUpper + rawDataMaster
	const rawData = rawDataStart + rawDataMaster

    blackList := make(map[string]bool)

	if len(dm.charms) > 0 {
		panic(errors.New(fmt.Sprintf("duplicated armors loading")))
	}

	scanner := newDataScannerFromString(rawData)
	var armorSetBonusId int
	var resistences [5]int
	for scanner.scanRow() {
		switch {
		case strings.HasPrefix(scanner.line, "@"):
			scanner.scanField()
			switch scanner.textValue()[1:] {
			case "set":
			case "bonus":
				for scanner.scanField() {
					switch scanner.fieldIndex {
					case 1:
						armorSetBonusId = dm.getArmorSetIdByName(scanner.textValue())
					}
				}
			case "resistences":
				for scanner.scanField() {
					field := scanner.fieldIndex
					switch field {
					case 1, 2, 3, 4, 5:
						resistences[field-1] = scanner.intValue()
					}
				}
			}
		default:
			a := newArmor()
			a.setBonusId = armorSetBonusId
			copy(a.resistences[:], resistences[:])
			slotLayout := [3]int{}
			for scanner.scanField() {
				field := scanner.fieldIndex
				switch field {
				case 0:
					a.component = scanner.intValue()
				case 1:
					a.name = scanner.textValue()
				case 2, 3, 4:
					slotSize := scanner.intValue()
					if slotSize < 0 || slotSize > 4 {
						panic(errors.New(fmt.Sprintf("invalid slot size %v", slotSize)))
					}
					slotLayout[field-2] = slotSize
				case 5, 7:
					a.skillEnhancements[(field-5)/2].skillId = dm.getSkillIdByName(scanner.textValue())
				case 6, 8:
					a.skillEnhancements[(field-6)/2].enhancedLevel = parseCheckedInt(scanner.textValue())
				default:
					fmt.Println("unexpected column near: ", scanner.line)
					panic(errors.New("unexpected column"))
				}
			}
            if blackList[a.name] {
                continue
            }
			slotCombinationId := dm.getSlotCombinationIdByLayout(slotLayout)
			a.slotCombination = *dm.getSlotCombinationById(slotCombinationId)
			dm.registerArmor(*a)
		}
	}
}
